{"dialog": [[{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My first car was a honda civic. _POTENTIALLY_UNSAFE__", "beam_texts": [["My first car was a honda civic. _POTENTIALLY_UNSAFE__", -3.8844428062438965], ["My first car was a honda civic. I loved that car. _POTENTIALLY_UNSAFE__", -4.987076759338379], ["My first car was a toyota corolla. I loved that car. _POTENTIALLY_UNSAFE__", -5.07060432434082], ["My first car was a honda civic. _POTENTIALLY_UNSAFE__", -6.478332996368408], ["My first car was a honda civic. _POTENTIALLY_UNSAFE____", -7.287243366241455], ["My first car was a honda civic. I loved that car. _POTENTIALLY_UNSAFE__", -7.3236212730407715], ["My first car was a toyota corolla. I loved that car. _POTENTIALLY_UNSAFE__", -7.402637481689453], ["My first car was a 1968 mustang convertible. I loved that car so much.", -7.491848945617676], ["My first car was a honda civic. _POTENTIALLY_UNSAFE__", -7.640354633331299], ["My first car was a honda civic. I loved that car. _POTENTIALLY_UNSAFE__ ", -7.876936435699463], ["My first car was a toyota corolla. I loved that car. _POTENTIALLY_UNSAFE__ ", -7.891992092132568]], "metrics": {"clen": 8.0, "ctrunc": 0.0, "ctrunclen": 0.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I had a Honda Civic as my first car, too! I loved that thing.", "beam_texts": [["I had a Honda Civic as my first car, too! I loved that thing.", -9.138385772705078], ["I had a Honda Civic as my first car, too! I loved that car.", -9.17070484161377], ["I had a Honda Civic as my first car, too! I loved that thing!", -9.401898384094238], ["I had a Honda Civic as my first car, too! It was a 1990.", -9.916742324829102], ["I had a Honda Civic as my first car, too! It was a 1986 model.", -10.049036026000977], ["I had a Honda Civic as my first car, too! I loved that car. I miss it.", -10.130250930786133], ["I had a Honda Civic as my first car, too! It was a 1989 model.", -10.149062156677246], ["I had a Honda Civic as my first car, too! It was a 1986.", -10.307204246520996], ["I had a Honda Civic as my first car, too! It was a 1989.", -10.325383186340332], ["I had a Honda Civic as my first car, too! It was a 1986 model. I loved that car.", -10.468266487121582], ["I had a Honda Civic as my first car, too! It was a 1989 model. I loved that car.", -10.549092292785645], ["I had a Honda Civic as my first car, too! It was a 1986 model. I loved that car!", -10.73139476776123], ["I had a Honda Civic as my first car, too! It was a 1986 model. I loved that thing.", -10.732511520385742]], "metrics": {"clen": 55.0, "ctrunc": 0.0, "ctrunclen": 0.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "What year was yours? Mine was a 1986. I still have it, but it needs a lot of work.", "beam_texts": [["What year was yours? Mine was a 1986. I still have it, but it needs a lot of work.", -9.991273880004883], ["What year was yours? Mine was a 1989. I still have it, but it needs a lot of work.", -10.045866966247559], ["What year was yours? Mine was a 1986. I still have it, but it needs some work.", -10.399418830871582], ["What year was yours? Mine was a 1989. I still have it, but it needs some work.", -10.469184875488281], ["What year was yours? Mine was a 1986. I still have it, but it needs a new battery.", -10.688644409179688], ["What year was yours? Mine was a 1989. I still have it, but it needs a new battery.", -10.756265640258789], ["What year was yours? Mine was a 1986. I loved it so much I bought another one.", -10.780718803405762], ["What year was yours? Mine was a 1986. I still have it, but it's not running.", -10.889265060424805], ["What year was yours? Mine was a 1986. I still have it, but it needs a lot of work to get it running again.", -10.907634735107422], ["What year was yours? Mine was a 1989. I still have it, but it's not running.", -10.957779884338379], ["What year was yours? Mine was a 1989. I still have it, but it needs a lot of work to get it running again.", -10.987099647521973], ["What year was yours? Mine was a 1986. I still have it, but it needs a lot of work to get it road ready.", -11.235166549682617], ["What year was yours? Mine was a 1989. I still have it, but it needs a lot of work to get it road ready.", -11.295924186706543]], "metrics": {"clen": 59.0, "ctrunc": 0.0, "ctrunclen": 0.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Mine was an 86 as well. It was a manual transmission, so it was a blast to drive.", "beam_texts": [["Mine was an 86 as well. It was a manual transmission, so it was a blast to drive.", -8.090085983276367], ["Mine was an 86 as well. It was a manual transmission, so it was fun to drive.", -8.182143211364746], ["Mine was an 86 as well. It was a manual transmission, and I loved it.", -8.345660209655762], ["Mine was an 86, too. It was a manual transmission, and I loved it.", -8.405709266662598], ["Mine was an 86 as well. It was a manual transmission, so I had to work on it a lot.", -8.552865028381348], ["Mine was an 86 as well. It was a manual transmission, so it was a blast to drive!", -8.650507926940918], ["Mine was an 86 as well. It was a manual transmission, so I had to work on it a lot too.", -8.774441719055176], ["Mine was an 86 as well. It was a manual transmission, so I had to work on that a lot.", -8.89700984954834], ["Mine was an 86 as well. It was a manual transmission, so it was a bit of a pain to work on.", -8.929672241210938], ["Mine was an 86 as well. It was a manual transmission, so I had to work on it a lot, too.", -9.048331260681152], ["Mine was an 86 as well. It was a manual transmission, so I had to work on it myself.", -9.083452224731445]], "metrics": {"clen": 105.0, "ctrunc": 0.0, "ctrunclen": 0.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That's awesome. I wish I knew how to drive a manual. I've always wanted to learn.", "beam_texts": [["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn.", -7.973796844482422], ["That's awesome. I wish I knew how to drive a manual. I would love to learn.", -7.990304946899414], ["That's awesome. I wish I knew how to drive a manual. I'd love to learn.", -8.144003868103027], ["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn, but never got around to it.", -8.502549171447754], ["That's awesome. I wish I knew how to drive stick. I would love to have a car like that.", -8.523358345031738], ["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn, but never had the time.", -8.623626708984375], ["That's awesome. I wish I knew how to drive a manual. I would love to learn how to do that.", -8.825529098510742], ["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn, but never got the chance.", -8.856405258178711], ["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn, but never had the opportunity.", -8.863991737365723], ["That's awesome. I wish I knew how to drive a manual. I've always wanted to learn, but I never had the time.", -9.023282051086426]], "metrics": {"clen": 111.0, "ctrunc": 0.0, "ctrunclen": 0.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "It's not too hard to learn, especially if you have a friend who knows how to teach you.", "beam_texts": [["It's not too hard to learn, especially if you have a friend who knows how to teach you.", -7.5789995193481445], ["It's not too hard to learn, especially if you have a friend who knows how to do it.", -7.723569869995117], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you if you'd like.", -8.067326545715332], ["It's not too hard to learn, especially if you have a friend who knows how to teach you!", -8.172183990478516], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you sometime.", -8.228619575500488], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you!", -8.293607711791992], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you if you want.", -8.349970817565918], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you if you're interested.", -8.384438514709473], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you if you'd like!", -8.387778282165527], ["It's not too hard to learn, especially if you have a friend who can teach you. I'd be happy to teach you sometime!", -8.520069122314453]], "metrics": {"clen": 153.0, "ctrunc": 1.0, "ctrunclen": 25.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That's a good idea. I'll have to see if I can find someone to teach me.", "beam_texts": [["That's a good idea. I'll have to see if I can find someone to teach me.", -5.783802509307861], ["That's a good idea. I'll have to see if I can find a friend to teach me.", -6.5038251876831055], ["That's a good idea. I'll have to see if I can find someone to help me.", -6.5181427001953125], ["That's a good idea. I'll have to see if I can find someone who can teach me.", -6.526891708374023], ["That's a good idea. I'll have to see if I can find anyone to teach me.", -6.5377044677734375], ["That's a good idea. I'll have to see if I can find someone to help me out.", -6.5784196853637695], ["That's a good idea. I'll have to see if I can find someone to teach me. Do you have any other hobbies?", -6.875028610229492], ["That's a good idea. I'll have to see if anyone I know can teach me. Do you have any other hobbies?", -6.877488613128662], ["That's a good idea. I'll have to see if I can find someone to teach me. How long have you been driving stick?", -7.055203914642334], ["That's a good idea. I'll have to see if I can find someone to teach me. How long did it take to learn?", -7.163280963897705]], "metrics": {"clen": 157.0, "ctrunc": 1.0, "ctrunclen": 29.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I'm sure there are plenty of people in your area who would be willing to help you out.", "beam_texts": [["I'm sure there are plenty of people in your area who would be willing to help you out.", -7.488595008850098], ["I'm sure there are plenty of people in your area who would be willing to help you learn.", -7.640079021453857], ["I'm sure there are plenty of people in your area who would be happy to help you out.", -7.754305839538574], ["I'm sure there are plenty of people in your area who would be happy to help you learn.", -7.793681621551514], ["I'm sure there are plenty of people in your area who would be willing to help you out!", -7.836885929107666], ["I'm sure there are plenty of people in your area who would be willing to help you learn!", -8.081565856933594], ["I'm sure there are plenty of people in your area who would be happy to help you out!", -8.096114158630371], ["I'm sure there are plenty of people in your area who would be happy to help you learn!", -8.20075798034668], ["I'm sure there are plenty of people who would be willing to help you out. I know I would.", -8.431775093078613], ["I'm sure there are plenty of people who would be willing to help you out. I know I would!", -8.6063871383667]], "metrics": {"clen": 198.0, "ctrunc": 1.0, "ctrunclen": 70.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That's good to know. Do you have any other hobbies that you like to do in your spare time?", "beam_texts": [["That's good to know. Do you have any other hobbies that you like to do in your spare time?", -7.299747467041016], ["That's good to know. Do you have any other hobbies that you like to do in your free time?", -7.632775783538818], ["I hope so. I don't want to be embarrassed in front of my friends and family.", -7.650976181030273], ["That's good to know. Do you have any other hobbies that you like to do with your friends?", -8.152883529663086], ["I hope so. I don't want to be embarrassed in front of my friends if I mess up.", -8.450088500976562], ["I hope so. I don't want to be embarrassed in front of my friends. Do you have any tips for me?", -8.533287048339844], ["I hope so. I don't want to be embarrassed in front of my friends. Do you have any other hobbies?", -8.674785614013672], ["I hope so. I don't want to be embarrassed in front of my friends. Do you have any advice for me?", -8.759395599365234], ["I hope so. I don't want to be embarrassed in front of my friends. Do you have any friends that can teach me?", -8.760422706604004], ["I hope so. I don't want to be embarrassed in front of my friends. Do you have any advice for that?", -8.791428565979004], ["That's good to know. Do you have any other hobbies that you like to do in your spare time? I like to read.", -9.473540306091309]], "metrics": {"clen": 201.0, "ctrunc": 1.0, "ctrunclen": 73.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like to play video games, but I don't have a lot of time for that these days. How about you?", "beam_texts": [["I like to play video games, but I don't have a lot of time for that these days. How about you?", -7.686824798583984], ["I like to play video games, but I don't have a lot of time for that these days.", -7.757311820983887], ["I like to play video games, but I don't have a lot of time for that right now. How about you?", -7.811434268951416], ["I like to play video games, but I don't have a lot of time for that right now.", -7.820089817047119], ["I like to play video games, but I don't have a lot of time for that anymore.", -7.91388463973999], ["I like to play video games, but I'm not very good at them. I'm more of a reader.", -8.352456092834473], ["I like to play video games. I play a lot of call of duty. I also like to read.", -8.385318756103516], ["I like to play video games, but I don't have a lot of time for that these days. How about yourself?", -8.682774543762207], ["I like to play video games. I play a lot of league of legends. I also like to read.", -8.70219898223877], ["I like to play video games, but I'm not very good at them. I'm more of a reader than anything.", -8.859813690185547]], "metrics": {"clen": 245.0, "ctrunc": 1.0, "ctrunclen": 117.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I enjoy playing video games as well. I also like to read books. What is your favorite book?", "beam_texts": [["I enjoy playing video games as well. I also like to read books. What is your favorite book?", -7.901493549346924], ["I enjoy playing video games as well. I also like to watch movies and tv shows. What video games do you play?", -8.102203369140625], ["I enjoy playing video games as well. I also like to read books. What is your favorite genre of books?", -8.156105995178223], ["I enjoy playing video games as well. I also like to watch movies and tv shows. What is your favorite video game?", -8.224963188171387], ["I enjoy playing video games as well. I also like to read books. What is your favorite genre of book?", -8.232919692993164], ["I enjoy playing video games as well. I also like to read books. What is your favorite video game?", -8.28436279296875], ["I enjoy playing video games as well. I also like to read books. What is your favorite genre?", -8.289999008178711], ["I enjoy playing video games as well. I also like to read books. What is your favorite genre to read?", -8.39250373840332], ["I enjoy playing video games as well. I also like to watch movies and tv shows. What is your favorite tv show?", -8.406258583068848], ["I enjoy playing video games as well. I also like to watch movies and tv shows. What video games do you like?", -8.461700439453125], ["I enjoy playing video games as well. I also like to watch movies and tv shows. What is your favorite genre?", -8.568018913269043], ["Video games are fun. I enjoy playing them as well. I also like to read.", -8.765447616577148], ["Video games are fun. I enjoy playing them as well. I also like to read books.", -8.93658447265625], ["Video games are fun. I enjoy playing them as well. I also like to watch movies.", -9.158425331115723]], "metrics": {"clen": 253.0, "ctrunc": 1.0, "ctrunclen": 125.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "My favorite book is the harry potter series by j. K. Rowling. Have you read any of her books?", "beam_texts": [["My favorite book is the harry potter series by j. K. Rowling. Have you read any of her books?", -5.364374160766602], ["My favorite book is the harry potter series by j.k. Rowling. Have you read any of her books?", -5.4478912353515625], ["My favorite book is the harry potter series by j. K. Rowling. Have you ever read it?", -5.585177898406982], ["My favorite book is the harry potter series by j. K. Rowling. Have you ever read them?", -5.612802028656006], ["My favorite book is the harry potter series by j. K. Rowling. What's yours?", -5.6549391746521], ["My favorite book is the harry potter series by j.k. Rowling. Have you ever read it?", -5.657358169555664], ["My favorite book is the harry potter series by j. K. Rowling. Have you read them?", -5.7278289794921875], ["My favorite book is the harry potter series by j. K. Rowling. Have you read it?", -5.744393348693848], ["My favorite book is the harry potter series by j. K. Rowling. Have you read any of those?", -5.892024040222168], ["My favorite book is the harry potter series by j. K. Rowling. Have you ever read any of them?", -6.136218547821045]], "metrics": {"clen": 295.0, "ctrunc": 1.0, "ctrunclen": 167.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "No, I haven't read her books. I have heard of them though. Are they good?", "beam_texts": [["No, I haven't read her books. I have heard of them though. Are they good?", -7.317350387573242], ["No, I haven't read her books. I have heard of them though. Are they any good?", -7.66327428817749], ["No, I haven't read her books. I have heard of them though. I will have to check them out.", -7.873581409454346], ["No, I haven't read her books. I have heard of them though. They are very popular.", -7.977573871612549], ["No, I haven't. I'm not a big fan of fantasy books. I prefer science fiction.", -8.233078002929688], ["No, I haven't read her books. I have heard of them though. I will have to give them a try.", -8.251440048217773], ["No, I haven't read her books. I have heard of them though. I will have to check them out!", -8.368356704711914], ["No, I haven't read her books. I have heard of them though. I will have to give them a read.", -8.524550437927246], ["No, I haven't read her books. I have heard of them though. They are popular.", -8.545626640319824], ["No, I haven't read her books. I have heard of them though. I will have to read them sometime.", -8.690178871154785], ["No, I haven't read her books. I have heard of them though. I will have to read them.", -8.853435516357422]], "metrics": {"clen": 305.0, "ctrunc": 1.0, "ctrunclen": 177.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Yes, they are very good. They are about wizards and witches in the wizarding world of hogwarts.", "beam_texts": [["Yes, they are very good. They are about wizards and witches in the wizarding world of hogwarts.", -6.393316268920898], ["Yes, they are very good. They are about wizards and witches in hogwarts.", -6.655881881713867], ["Yes, they are very good. They are about wizards and witches in the wizarding world of hogwarts", -7.253508567810059], ["Yes, they are very good. They are about wizards and witches in hogwarts. I think you would like them.", -7.276900291442871], ["Yes, they are very good. They are about wizards and witches in hogwarts. You should check them out.", -7.321126937866211], ["Yes, they are very good. They are about wizards and witches in the wizarding world.", -7.35715913772583], ["Yes, they are very good. They are about wizards and witches in hogwarts. I highly recommend them.", -7.420854091644287], ["Yes, they are very good. They are about wizards and witches in hogwarts. You should check them out!", -7.427460670471191], ["Yes, they are very good. They are about wizards and witches in hogwarts", -7.529138565063477], ["Yes, they are very good. They are about wizards and witches in hogwarts. You should read them.", -7.667514801025391]], "metrics": {"clen": 346.0, "ctrunc": 1.0, "ctrunclen": 218.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That sounds interesting. I will have to check them out. Do you have any other books you would recommend?", "beam_texts": [["That sounds interesting. I will have to check them out. Do you have any other books you would recommend?", -6.1337127685546875], ["That sounds interesting. I'll have to check them out. Do you have any other books you would recommend?", -6.325567245483398], ["That sounds interesting. I will have to check them out. Do you have any other books you recommend?", -6.349883556365967], ["That sounds interesting. I'll have to check them out. Do you have any other books you recommend?", -6.372143745422363], ["That sounds interesting. I will have to check them out. Do you have any other hobbies?", -6.380472660064697], ["That sounds interesting. I'll have to check them out sometime. What other books do you like?", -6.415225982666016], ["That sounds interesting. I will have to check them out sometime. Do you have any other books you would recommend?", -6.5297980308532715], ["That sounds interesting. I'll have to check them out sometime. Do you have any other books you would recommend?", -6.583305358886719], ["That sounds interesting. I'll have to check them out sometime. Do you have any other books you'd recommend?", -6.624690532684326], ["That sounds interesting. I'll have to check them out sometime. Do you have any other books you recommend?", -6.638506889343262], ["That sounds interesting. I will have to check them out. Do you have any other books that you like?", -6.682150840759277], ["That sounds interesting. I will have to check them out sometime. Do you have any other books you would suggest?", -7.472956657409668]], "metrics": {"clen": 359.0, "ctrunc": 1.0, "ctrunclen": 231.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is the best book in the series.", "beam_texts": [["Harry potter and the prisoner of azkaban is the best book in the series.", -4.710265636444092], ["Harry potter and the prisoner of azkaban is one of my favorites.", -4.755351543426514], ["Harry potter and the prisoner of azkaban is one of my favorite books.", -5.055444240570068], ["Harry potter and the prisoner of azkaban is one of the best books in the series.", -5.063526630401611], ["Harry potter and the prisoner of azkaban is a good one. It is about harry and his friends.", -6.271290302276611], ["Harry potter and the prisoner of azkaban is a good one. It's about harry and his friends.", -6.31197452545166], ["Harry potter and the prisoner of azkaban is one of the best books in the series. I would recommend that one.", -6.372678279876709], ["Harry potter and the prisoner of azkaban is a good one. It is about harry and his friends in prison.", -6.751917839050293], ["Harry potter and the prisoner of azkaban is a good one. It's about harry and his friends in prison.", -6.786726951599121], ["Harry potter and the prisoner of azkaban is a good one. It is about harry and his friends in the school.", -7.317046642303467]], "metrics": {"clen": 402.0, "ctrunc": 1.0, "ctrunclen": 274.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That sounds like a good one to start with. Thank you for the recommendation. What is your favorite book?", "beam_texts": [["That sounds like a good one to start with. Thank you for the recommendation. What is your favorite book?", -7.553263187408447], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to read it.", -7.680216312408447], ["That sounds like a good one to start with. Thank you for the recommendation. How are your cats doing?", -7.75080680847168], ["That sounds like a good one to start with. Thanks for the recommendation. How is your job going?", -7.774338722229004], ["That sounds like a good one to start with. Thank you for the recommendation. What is your favorite food?", -7.810357093811035], ["That sounds like a good one to start with. Thanks for the recommendation! Do you like to read?", -7.86491060256958], ["That sounds like a good one to start with. Thank you for the recommendation. How is work going?", -7.9480881690979], ["That sounds like a good one to start with. Thank you for the recommendation. I hope you have a great day.", -7.959839344024658], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to read it!", -8.04375171661377], ["That sounds like a good one to start with. Thank you for the recommendation. I hope you have a great day!", -8.129172325134277], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to start reading.", -8.185131072998047], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to read it now.", -8.291751861572266], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to start reading it.", -8.334212303161621], ["That sounds like a good one to start with. Thank you for the recommendation. I am excited to read it now!", -8.520842552185059]], "metrics": {"clen": 406.0, "ctrunc": 1.0, "ctrunclen": 278.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "My favorite book is the first harry potter book by j. K. Rowling.", "beam_texts": [["My favorite book is the first harry potter book by j. K. Rowling.", -4.931107044219971], ["My favorite book is the first harry potter book by j.k. Rowling.", -5.138859272003174], ["My favorite book is the harry potter series by j. K. Rowling. Have you read any of her books?", -5.371541500091553], ["My favorite book is the harry potter series by j. K. Rowling. Have you read it?", -5.384775161743164], ["My favorite book is the harry potter series by j.k. Rowling. Have you read any of her books?", -5.4049553871154785], ["My favorite book is the harry potter series by j.k. Rowling. Have you read it?", -5.462747573852539], ["My favorite book is the harry potter series by j. K. Rowling. Have you ever read it?", -5.547487735748291], ["My favorite book is the harry potter series by j. K. Rowling. Have you read them?", -5.548919677734375], ["My favorite book is the harry potter series by j.k. Rowling. Have you read them?", -5.606329917907715], ["My favorite book is the harry potter series by j.k. Rowling. Have you ever read it?", -5.613533973693848]], "metrics": {"clen": 450.0, "ctrunc": 1.0, "ctrunclen": 322.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I haven't read that one, but I have heard good things about it. Have you read any of her other books?", "beam_texts": [["I haven't read that one, but I have heard good things about it. Have you read any of her other books?", -6.985709190368652], ["I haven't read that one, but I have heard good things about it. Is it your favorite of the series?", -7.30230712890625], ["I haven't read that one, but I have heard good things about it. Have you read all of them?", -7.382059097290039], ["I haven't read that one, but I have heard good things about it. Have you read any of the other books?", -8.156499862670898], ["I haven't read that one, but I have heard good things about it. Is it your favorite because of the plot or the characters?", -8.207837104797363], ["I haven't read that one, but I have heard good things about it. Is it your favorite because it's the first in a series?", -8.415984153747559], ["I haven't read that one, but I have heard good things about it. Is it your favorite because of the plot or the writing style?", -8.511865615844727], ["I haven't read that one, but I have heard good things about it. Is it your favorite because it's the first one?", -8.537149429321289], ["I haven't read that one, but I have heard good things about it. Is it your favorite because it's the first book in a series?", -8.555320739746094], ["I haven't read that one, but I have heard good things about it. Is it your favorite because of the plot or the writing?", -8.588069915771484]], "metrics": {"clen": 453.0, "ctrunc": 1.0, "ctrunclen": 325.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Yes, I have read all of them except for the last one. I just haven't gotten around to it yet.", "beam_texts": [["Yes, I have read all of them except for the last one. I just haven't gotten around to it yet.", -7.548555850982666], ["Yes, I have read all of them except for the last one. I just haven't gotten around to reading it yet.", -7.7791008949279785], ["Yes, I have read all of them except for the last one. I just haven't gotten around to it.", -7.881408214569092], ["Yes, I have read all of them except for the last one. I just haven't gotten to it yet.", -7.949158668518066], ["Yes, I have read all of them except for the last one. I am waiting for that one to come out.", -8.098623275756836], ["Yes, I have read all of them except for the last one. I just haven't had the time.", -8.162096977233887], ["Yes, I have read all of them except for the last one. I just haven't gotten around to reading it.", -8.183829307556152], ["Yes, I have read all of them except for the last one. I just haven't had time.", -8.307022094726562], ["Yes, I have read all of them except for the last one. I just haven't had the time to read them.", -8.309041023254395], ["Yes, I have read all of them except for the last one. I am currently re-reading the first book.", -8.341686248779297], ["Yes, I have read all of them except for the last one. I am currently re-reading the first one.", -8.358132362365723]], "metrics": {"clen": 499.0, "ctrunc": 1.0, "ctrunclen": 371.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "What is it about the book that makes you like it so much? Is it about wizards?", "beam_texts": [["What is it about the book that makes you like it so much? Is it about wizards?", -7.449223518371582], ["What is it about the book that makes you like it so much? Is it the story or the characters?", -7.648096561431885], ["What is it about the book that makes you like it so much? Is it the plot or the characters?", -7.787370681762695], ["What is it about the book that makes you like it so much? Is it about wizards or something?", -7.832828521728516], ["What is it about the book that makes you like it so much? Is it because it is about wizards?", -7.835083961486816], ["What is it about the book that makes you like it so much? Is it because it's about wizards?", -7.866305351257324], ["What is it about the book that makes you like it so much? Is it the characters or the plot?", -7.9902753829956055], ["What is it about the book that makes you like it so much? Is it the characters or the plot or something else?", -8.088479042053223], ["What is it about the book that makes you like it so much? Is it about wizards or something else?", -8.213485717773438], ["What is it about the book that makes you like it so much? Is it the story or is it the characters?", -8.280951499938965], ["What is it about the book that makes you like it so much? Is it about wizards or magic or something?", -8.387411117553711]], "metrics": {"clen": 506.0, "ctrunc": 1.0, "ctrunclen": 378.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Yes, it's about the wizard world of hogwarts. It's very interesting.", "beam_texts": [["Yes, it's about the wizard world of hogwarts. It's very interesting.", -7.319610118865967], ["Yes, it's about the wizard world of hogwarts. It's really interesting.", -7.3790364265441895], ["Yes, it's about the wizard world of hogwarts. It's really cool.", -7.619553089141846], ["Yes, it's about the wizard world of hogwarts. It's so interesting.", -7.815959453582764], ["Yes, it's about the wizard world of hogwarts. It's a really good book.", -7.8177385330200195], ["Yes, it's about the wizard world of hogwarts. It's a really good read.", -7.978888511657715], ["Yes, it's about the wizard world of hogwarts. It's a great book.", -7.98720121383667], ["Yes, it's about the wizard world of hogwarts. It's a really good book. I would recommend it.", -9.38044261932373], ["Yes, it's about the wizard world of hogwarts. It's really interesting to see all of the different schools.", -9.531124114990234], ["Yes, it's about the wizard world of hogwarts. It's really interesting to see all of the different places.", -9.814653396606445]], "metrics": {"clen": 548.0, "ctrunc": 1.0, "ctrunclen": 420.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That does sound interesting. Do you have a favorite character in the book or do you like all the characters?", "beam_texts": [["That does sound interesting. Do you have a favorite character in the book or do you like all the characters?", -8.142158508300781], ["That does sound interesting. Do you have a favorite character in the book or do you like all of the characters?", -8.269905090332031], ["That does sound interesting. I've never read it, but it sounds like something I would like.", -8.286744117736816], ["That does sound interesting. I've never read it, but it sounds like something I would enjoy.", -8.29352855682373], ["That does sound interesting. Do you have a favorite character in the book or is it more about the world?", -8.298439979553223], ["That does sound interesting. Do you have a favorite character in the book? I like harry.", -8.378133773803711], ["That does sound interesting. Do you have a favorite character in the book or is it more about the world itself?", -8.385614395141602], ["That does sound interesting. Do you have a favorite character in the book or do you like all the characters equally?", -8.531993865966797], ["That does sound interesting. I've never read it, but it sounds like something I'd like to read.", -8.535122871398926], ["That does sound interesting. I've never read it, but it sounds like it would be interesting to read.", -8.553805351257324], ["That does sound interesting. I've never read it, but it sounds like something I'd like.", -8.617424964904785], ["That does sound interesting. I've never read it, but it sounds like it would be interesting to read about.", -9.108176231384277]], "metrics": {"clen": 553.0, "ctrunc": 1.0, "ctrunclen": 425.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I really like harry potter and the prisoner of azkaban is my favorite book.", "beam_texts": [["I really like harry potter and the prisoner of azkaban is my favorite book.", -4.952447414398193], ["I really like harry potter and the prisoner of azkaban is my favorite.", -5.1773600578308105], ["I really like harry potter and the prisoner of azkaban is the best book in the series.", -5.37933349609375], ["I really like harry potter and the prisoner of azkaban is my favorite book in the series.", -5.384220600128174], ["I really like harry potter and the prisoner of azkaban is my favorite book. What is your favorite book?", -5.527486801147461], ["I really like harry potter and the prisoner of azkaban. What is your favorite book?", -5.604423522949219], ["I really like harry potter and the prisoner of azkaban is one of my favorites.", -5.6887946128845215], ["I really like harry potter and the prisoner of azkaban is one of the best books in the series.", -5.6902618408203125], ["I really like harry potter and the prisoner of azkaban is my favorite book. What's your favorite book?", -5.815365314483643], ["I really like harry potter and the prisoner of azkaban is my favorite book. What is your favorite?", -5.993205547332764], ["I really like harry potter and the prisoner of azkaban is my favorite book. What's your favorite?", -6.115506649017334]], "metrics": {"clen": 596.0, "ctrunc": 1.0, "ctrunclen": 468.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter is a great book. Have you read all the books or just the first one?", "beam_texts": [["Harry potter is a great book. Have you read all the books or just the first one?", -6.570396900177002], ["Harry potter is a great book. Have you read any of the other books in the series?", -6.826981544494629], ["Harry potter is a great book. Have you read any of the other books by j. K. Rowling?", -6.897931098937988], ["Harry potter is a great book. Have you read any of the other books by j.k. Rowling?", -7.008306980133057], ["Harry potter is a great book. Have you read all the books in the series or just the first one?", -7.626864433288574], ["Harry potter is a great book. Have you read all the books or are there some you haven't read yet?", -7.700263977050781], ["Harry potter is a great book. Have you read all the books or just the first book?", -7.739574432373047], ["Harry potter is a great book. Have you read any of the other books in the series or just the first one?", -7.808021068572998], ["Harry potter is a great book. Have you read all the books or are there some you haven't read?", -8.014148712158203], ["Harry potter is a great book. Have you read all the books in the series or just the first?", -8.152725219726562], ["Harry potter is a great book. Have you read any of the other books in the series or just the first?", -8.185111045837402], ["Harry potter is a great book. Have you read any of the other books by j. K. Rowlings?", -8.25879955291748], ["Harry potter is a great book. Have you read all the books or are there some you haven't?", -8.350449562072754], ["Harry potter is a great book. Have you read any of the other books by j. K. Rowling.", -8.571931838989258]], "metrics": {"clen": 601.0, "ctrunc": 1.0, "ctrunclen": 473.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I have read all of them. My favorite character is snape. What is your favorite character?", "beam_texts": [["I have read all of them. My favorite character is snape. What is your favorite character?", -6.790464878082275], ["I have read all of them. My favorite character is snape. What is your favorite book?", -6.828698635101318], ["I have read all of them except the last one. I don't like that one as much.", -6.835495948791504], ["I have read all of them except the last one. I don't like that one as much as the others.", -7.034373760223389], ["I have read all of them except the last one. I haven't had time to read lately.", -7.321548938751221], ["I have read all of them except the last one. I don't like that one as much as the rest.", -7.511781215667725], ["I have read all of them except the last one. I don't know why I haven't read it.", -7.658731937408447], ["I have read all of them except the last one. I haven't had time to read recently.", -7.756077289581299], ["I have read all of them except the last one. I don't know why I haven't read that one.", -7.860175609588623], ["I have read all of them except the last one. I don't like that one as much as the first.", -8.0819673538208]], "metrics": {"clen": 642.0, "ctrunc": 1.0, "ctrunclen": 514.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My favorite is dudley dursley. He is such a lovable character. How about you?", "beam_texts": [["My favorite is dudley dursley. He is such a lovable character. How about you?", -7.7869343757629395], ["My favorite is dudley dursley. He is such a lovable character. What about you?", -7.884511470794678], ["My favorite is dudley dursley. He's such a lovable character. What's your favorite book?", -8.227701187133789], ["My favorite is dudley dursley. He is such a lovable character. Snape is also a great character.", -8.2861909866333], ["My favorite is dudley dursley. He's such a lovable character. What's your favorite part of the book?", -8.316366195678711], ["My favorite is dudley dursley. He's such a lovable character. What's your favorite part of the books?", -8.326554298400879], ["My favorite is dudley dursley. He's such a lovable character. What's your favorite?", -8.409232139587402], ["My favorite is dudley dursley. He is such a lovable character. Snape is great too.", -8.515564918518066], ["My favorite is dudley dursley. He is such a lovable character. Snape is a good character too.", -8.525569915771484], ["My favorite is dudley dursley. He is such a lovable character. Snape was a great character as well.", -8.616254806518555], ["My favorite is dudley dursley. He is such a lovable character. Snape was a great character too.", -8.649600982666016], ["My favorite is dudley dursley. He is such a lovable character. Snape is a good character as well.", -8.672701835632324], ["My favorite is dudley dursley. He is such a lovable character. Snape is great too though.", -8.708839416503906]], "metrics": {"clen": 645.0, "ctrunc": 1.0, "ctrunclen": 517.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Dudley is a good character. I like him too. I also like voldemort.", "beam_texts": [["Dudley is a good character. I like him too. I also like voldemort.", -7.317185878753662], ["Dudley is a good character. I like him too. I also like the dursleys.", -8.137215614318848], ["Dudley is a good character. I like him too. I also like voldemort a lot.", -8.168471336364746], ["Dudley is a good character. I like him too. I think my favorite is harry.", -8.222969055175781], ["Dudley is a good character. I like him too. I also like voldemort. He was a great villain.", -8.276479721069336], ["Dudley is a good character. I like him too. I also like voldemort", -8.382596969604492], ["Dudley is a good character. I like him too. I also like voldemort. He was a good villain.", -8.427229881286621], ["Dudley is a good character. I like him too. I also like voldemort. He's a great villain.", -8.502066612243652], ["Dudley is a good character. I like him too. I also like voldemort, he is a very interesting character.", -8.60207748413086], ["Dudley is a good character. I like him too. I also like voldemort. He was a great villian.", -8.615190505981445], ["Dudley is a good character. I like him too. I also like voldemort. I don't know why.", -8.870208740234375]], "metrics": {"clen": 688.0, "ctrunc": 1.0, "ctrunclen": 560.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That's cool. I don't think I've ever met anyone who likes snape as much as I do.", "beam_texts": [["That's cool. I don't think I've ever met anyone who likes snape as much as I do.", -8.764971733093262], ["That's cool. Do you have any pets? I have a dog and a cat. I love them.", -9.107271194458008], ["That's cool. I don't think I've ever met anyone who likes snape as much as me.", -9.234439849853516], ["That's cool. I don't think I've ever met anyone who likes snape as much as I do!", -9.246033668518066], ["That's cool. I don't think I've ever met anyone who likes voldermort before.", -9.26814079284668], ["That's cool. I don't think I've ever met anyone who likes snape as much as you do.", -9.351688385009766], ["That's cool. I don't think I've ever met anyone who likes voldermort. Do you have a favorite book?", -9.353898048400879], ["That's cool. I don't think I've ever met anyone who likes snape as much as I do. What's your favorite book?", -9.444906234741211], ["That's cool. I don't think I've ever met anyone who likes snape as much as you.", -9.514994621276855], ["That's cool. I don't think I've ever met anyone who likes snape as much as I do. He's my favorite.", -9.759679794311523], ["That's cool. I don't think I've ever met anyone who likes snape as much as I do. He's my favorite character.", -9.781562805175781]], "metrics": {"clen": 692.0, "ctrunc": 1.0, "ctrunclen": 564.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like snape too. He's a great character. What's your favorite harry potter book?", "beam_texts": [["I like snape too. He's a great character. What's your favorite harry potter book?", -6.253520965576172], ["I like snape a lot too. He's a great character. What's your favorite harry potter book?", -6.568996906280518], ["I like snape a lot too. He's a great character. Do you like harry potter?", -7.103368759155273], ["I like snape a lot too. He's a great character. Do you like harry potter too?", -7.255399703979492], ["I like snape a lot too. He's a great character. What's your favorite book?", -7.423247814178467], ["I like snape a lot too. He's a great character. Do you like harry potter as well?", -7.44873571395874], ["I like snape a lot too. He's a great character. Do you like harry potter at all?", -7.464609622955322], ["I like snape a lot too. He's a great character. Do you have a favorite book?", -7.752391338348389], ["I like snape a lot too. He's a great character. Do you like any other characters?", -7.863920211791992], ["I like snape too. He's a great character. What's your favorite harry potter novel?", -7.896647930145264]], "metrics": {"clen": 736.0, "ctrunc": 1.0, "ctrunclen": 608.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling.", "beam_texts": [["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling.", -3.765619993209839], ["Harry potter and the prisoner of azkaban by j. K. Rowling.", -4.118714809417725], ["Harry potter and the prisoner of azkaban is my favorite book by j.k. Rowling.", -4.196499347686768], ["Harry potter and the prisoner of azkaban by j. K. Rowling. Have you read it?", -4.335691928863525], ["Harry potter and the prisoner of azkaban by j. K. Rowling is my favorite.", -4.449696063995361], ["Harry potter and the prisoner of azkaban by j. K. Rowling", -4.473830223083496], ["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling. Have you read it?", -4.494984149932861], ["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling", -4.535849094390869], ["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling. Have you ever read it?", -4.630365371704102], ["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling. Have you read that one?", -4.868687629699707], ["Harry potter and the prisoner of azkaban is my favorite book by j. K. Rowling. Do you have a favorite?", -4.9836225509643555]], "metrics": {"clen": 741.0, "ctrunc": 1.0, "ctrunclen": 613.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I haven't read that one. I'll have to check it out. Do you like any other books?", "beam_texts": [["I haven't read that one. I'll have to check it out. Do you like any other books?", -5.901251792907715], ["I haven't read that one. I'll have to check it out. Have you read all the books?", -6.055782318115234], ["I haven't read that one. I'll have to check it out. Do you have any other books you'd recommend?", -6.080296993255615], ["I haven't read that one. I'll have to check it out. Have you read any of the other books in the series?", -6.251457214355469], ["I haven't read that one. I'll have to check it out. Do you have any other books you like to read?", -6.257981300354004], ["I haven't read that one. I'll have to check it out. Do you have any other books you like?", -6.4835124015808105], ["I haven't read that one. I'll have to check it out. Do you have any other books you recommend?", -6.517129898071289], ["I haven't read that one. I'll have to check it out. Have you read any of the other books?", -6.6513776779174805], ["I haven't read that one. I'll have to check it out. Do you have any other books you'd like to recommend?", -7.037193775177002], ["I haven't read that one. I'll have to check it out. Do you have any other books you'd recommend me reading?", -7.228646278381348], ["I haven't read that one. I'll have to check it out. Do you have any other books you'd like to read?", -7.433128833770752]], "metrics": {"clen": 788.0, "ctrunc": 1.0, "ctrunclen": 660.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I like a lot of other books. My favorite book of all time is the dark tower series by stephen king.", "beam_texts": [["I like a lot of other books. My favorite book of all time is the dark tower series by stephen king.", -7.7508721351623535], ["I like a lot of other books. My favorite book of all time is the hunger games.", -7.776767730712891], ["I like a lot of other books. My favorite book of all time is the princess bride.", -8.025349617004395], ["I like a lot of other books. My favorite book of all time is the dark tower by stephen king.", -8.032816886901855], ["I like a lot of other books. My favorite book of all time is the hunger games. Have you read it?", -8.049409866333008], ["I like a lot of other books. My favorite book of all time is the hunger games. Have you ever read it?", -8.061108589172363], ["I like a lot of other books. My favorite book of all time is the prince of persia.", -8.203841209411621], ["I like a lot of other books. My favorite book of all time is the hunger games series.", -8.437453269958496], ["I like a lot of other books. My favorite book of all time is the book of mormon.", -8.4917631149292], ["I like a lot of other books. My favorite book of all time is the dark tower series by stephen king", -8.754505157470703]], "metrics": {"clen": 793.0, "ctrunc": 1.0, "ctrunclen": 665.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I've never read any of his books, but I've seen the movies. They were pretty good.", "beam_texts": [["I've never read any of his books, but I've seen the movies. They were pretty good.", -6.900815963745117], ["I've never read any of stephen kings books, but I've heard good things about them.", -6.975538730621338], ["I've never read any of stephen kings books, but I've heard good things about him.", -7.380653381347656], ["I've never read any of his books, but I've seen the movies. They were pretty good!", -7.446682929992676], ["I've never read any of stephen kings books, but I've heard good things about his books.", -7.591692924499512], ["I've never read any of his books, but I've heard good things about them. What is your favorite part of the book?", -7.707778453826904], ["I've never read any of stephen kings books, but I've heard good things about his work.", -7.8016510009765625], ["I've never read any of his books, but I've heard good things about them. What is your favorite part of the series?", -7.807133674621582], ["I've never read any of his books, but I've heard good things about them. What is your favorite book?", -7.896483421325684], ["I've never read any of his books, but I've heard good things about them. What is your favorite part?", -7.910709857940674], ["I've never read any of stephen kings books, but I've heard good things about them. What is your favorite one?", -7.92515230178833], ["I've never read any of his books, but I've heard good things about them. What is your favorite part about them?", -8.081948280334473], ["I've never read any of stephen kings books, but I've heard good things about them. What is your favorite book?", -8.103873252868652], ["I've never read any of stephen kings books, but I've heard good things about them. What is your favorite part?", -8.143401145935059]], "metrics": {"clen": 838.0, "ctrunc": 1.0, "ctrunclen": 710.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "The movies are good, but the books are so much better. You should give them a try.", "beam_texts": [["The movies are good, but the books are so much better. You should give them a try.", -7.22188138961792], ["The movies are good, but the books are better in my opinion. What is your favorite book?", -7.338301181793213], ["The movies are good, but the books are so much better. Have you read any good books lately?", -7.3396501541137695], ["The movies are good, but the books are better in my opinion. What is your favorite movie?", -7.3743815422058105], ["The movies are good, but the books are so much better. You should read them sometime.", -7.4239654541015625], ["The movies are good, but the books are so much better. You should give them a try!", -7.734319686889648], ["The movies are good, but the books are so much better. You should give them a read.", -7.881714344024658], ["The movies are good, but the books are so much better. You should give them a shot.", -8.003983497619629], ["The movies are good, but the books are so much better. You should give them a try sometime", -8.657578468322754], ["The movies are good, but the books are so much better. You should give them a read sometime", -9.063443183898926]], "metrics": {"clen": 842.0, "ctrunc": 1.0, "ctrunclen": 714.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I think I will. I'm always looking for something new to read. What else do you like to read?", "beam_texts": [["I think I will. I'm always looking for something new to read. What else do you like to read?", -6.883172988891602], ["I think I will. I'm always looking for something new to read. What else do you like to do?", -7.109319686889648], ["I think I will. I'm always looking for something new to read. What else do you like to do for fun?", -7.1854329109191895], ["I might have to do that. I'm always looking for something new to read. What else do you like to read?", -7.274761199951172], ["I think I will. I'm always looking for something new to read. What's your favorite book?", -7.284222602844238], ["I might have to do that. I'm always looking for something new to read. What else do you like to do?", -7.483822345733643], ["I think I will. I'm always looking for something new to read. What's your favorite genre?", -7.599506378173828], ["I think I will. I'm always looking for something new to read. What's your favorite genre to read?", -7.60882568359375], ["I think I will. I'm always looking for something new to read. What else do you like to do besides read?", -7.64605188369751], ["I might have to do that. I'm always looking for something new to read. What's your favorite book?", -7.657264709472656], ["I think I will. I'm always looking for something new to read. What's your favorite genre of books?", -7.719423770904541], ["I think I will. I'm always looking for something new to read. What else do you like?", -8.256950378417969]], "metrics": {"clen": 883.0, "ctrunc": 1.0, "ctrunclen": 755.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is the best book in the series.", "beam_texts": [["Harry potter and the prisoner of azkaban is the best book in the series.", -4.301328182220459], ["Harry potter and the prisoner of azkaban is my all time favorite book.", -4.718939781188965], ["Harry potter and the prisoner of azkaban is one of my favorites.", -4.916411399841309], ["Harry potter and the prisoner of azkaban is one of the best books in the series.", -4.955709457397461], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you read it?", -4.989186763763428], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you ever read it?", -5.388333797454834], ["Harry potter and the prisoner of azkaban is my favorite book by j.k.", -5.49153470993042], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you read it yet?", -5.7607340812683105], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you read that?", -5.967484951019287], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you ever read that?", -6.321816444396973]], "metrics": {"clen": 889.0, "ctrunc": 1.0, "ctrunclen": 761.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I haven't read that one yet. I'll have to pick it up next time I'm at the library.", "beam_texts": [["I haven't read that one yet. I'll have to pick it up next time I'm at the library.", -5.661030292510986], ["I haven't read that one yet. I'll have to pick it up next time I'm at the bookstore.", -5.753282070159912], ["I haven't read that one yet. I'll have to pick it up next time I go to the library.", -5.893032073974609], ["I haven't read that one yet. I'll have to check it out. What is it about?", -5.9804511070251465], ["I haven't read that one yet. I'll have to check it out. What's it about?", -5.992749214172363], ["I haven't read that one yet. I'll have to pick it up next time I go to the bookstore.", -6.002983093261719], ["I haven't read that one yet. I'll have to pick it up next time I'm at the book store.", -6.086268901824951], ["I haven't read that one yet. I'll have to pick it up next time I go to the book store.", -6.2427496910095215], ["I haven't read that one yet. I'll have to pick it up next time I'm at the store.", -6.310885906219482], ["I haven't read that one yet. I'll have to check it out. What's your favorite book?", -6.5524678230285645], ["I haven't read that one yet. I'll have to pick it up next time I'm at the bookstore!", -6.570352554321289], ["I haven't read that one yet. I'll have to pick it up next time I'm at the bookstore", -6.765556335449219]], "metrics": {"clen": 931.0, "ctrunc": 1.0, "ctrunclen": 803.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite harry potter book? Mine is the goblet of fire.", "beam_texts": [["Do you have a favorite harry potter book? Mine is the goblet of fire.", -6.301362037658691], ["Do you have a favorite harry potter book? Mine is the chamber of secrets.", -6.3925700187683105], ["Do you have a favorite harry potter book? Mine is the deathly hallows part 1.", -7.4167094230651855], ["Do you have a favorite harry potter book? Mine is the deathly hallows part 2.", -7.456969738006592], ["Do you have a favorite harry potter book? Mine is the deathly hallows book.", -7.879307746887207], ["Do you have a favorite harry potter book? Mine is the deathly hallows pt 2.", -7.918206214904785], ["Do you have a favorite harry potter book? Mine is the deathly hallows pt. 2", -8.097352027893066], ["Do you have a favorite harry potter book? Mine is the deathly hallows part 1", -8.113208770751953], ["Do you have a favorite harry potter book? Mine is the deathly hallows pt 2", -8.367069244384766], ["Do you have a favorite harry potter book? Mine is the deathly hallows pt. 1", -8.61867904663086]], "metrics": {"clen": 937.0, "ctrunc": 1.0, "ctrunclen": 809.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like that one too. I also like the one where they go to hogwarts.", "beam_texts": [["I like that one too. I also like the one where they go to hogwarts.", -6.4784016609191895], ["I like that one too. I also like the one where they go to hogwarts for the first time.", -7.027632713317871], ["I like that one too. I like all of them, but I think the first one is my favorite.", -7.257396697998047], ["I like that one too. I like all of them, but I like the first one the best.", -7.339539051055908], ["I like that one too. I like all of them, but it's hard to pick a favorite.", -7.344832420349121], ["I like that one too. I like all of them, but it's hard to choose a favorite.", -7.453526020050049], ["I like that one too. I like all of them, but I like the first one best.", -7.653240203857422], ["I like that one too. I also like the one where they go to hogwarts. What's your favorite book?", -7.746906757354736], ["I like that one too. I also like the one where they go to hogwarts. What is your favorite book?", -7.784705638885498], ["I like that one too. I also like the one where they go to hogwarts. I don't remember the name.", -7.864856243133545], ["I like that one too. I also like the one where they go to hogwarts. I don't remember the title.", -7.923699855804443]], "metrics": {"clen": 978.0, "ctrunc": 1.0, "ctrunclen": 850.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you like any of the other books by j.k. Rowling? She is a great author.", "beam_texts": [["Do you like any of the other books by j.k. Rowling? She is a great author.", -7.58350133895874], ["Do you like any of the other books by j.k. Rowling? She is a great writer.", -7.673506259918213], ["Do you like any of the other books by j.k. Rowling? I think she is a great author.", -7.938814163208008], ["Do you like any of the other books by j.k. Rowling? I think she is a great writer.", -8.041900634765625], ["Do you like any of the other books by j.k. Rowling? She is a great writer!", -8.604830741882324], ["Do you like any of the other books by j.k. Rowling? I think she is a great writer!", -9.229620933532715], ["Do you like any of the other books by j.k. Rowling? She is a great writer and has written a lot of books.", -9.314708709716797], ["Do you like any of the other books by j.k. Rowling? She is a great writer and has written a lot.", -9.936858177185059], ["Do you like any of the other books by j.k. Rowling? She is a great writer and has written a lot of books!", -10.322209358215332], ["Do you like any of the other books by j.k. Rowling? She is a great writer and has written a lot of books", -10.573843955993652]], "metrics": {"clen": 982.0, "ctrunc": 1.0, "ctrunclen": 854.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I have not read any of her other books, but I would like to. What is your favorite book?", "beam_texts": [["I have not read any of her other books, but I would like to. What is your favorite book?", -6.3394975662231445], ["I have not read any of her other books, but I would like to. What is your favorite book by her?", -6.502346992492676], ["I have not read any of her other books, but I would like to. What is your favorite?", -6.613969802856445], ["I have not read any of her other books, but I would like to. What is your favorite one?", -6.899322986602783], ["I have not read any of her other books, but I have seen the movies. They were pretty good.", -6.970905780792236], ["I've never read any of her books, but I've heard good things about them. What's your favorite?", -7.032878875732422], ["I have not read any of her other books, but I have seen the movies. They were good.", -7.13999080657959], ["I've never read any of her books, but I've heard good things about them. What is your favorite?", -7.147151947021484], ["I've never read any of her books, but I've heard good things about them. What is your favorite book?", -7.278637886047363], ["I've never read any of her books, but I've heard good things about them. What's your favorite book?", -7.424874782562256]], "metrics": {"clen": 1026.0, "ctrunc": 1.0, "ctrunclen": 898.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is my all time favorite book.", "beam_texts": [["Harry potter and the prisoner of azkaban is my all time favorite book.", -4.245408058166504], ["Harry potter and the prisoner of azkaban is one of my favorites.", -4.258719444274902], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them.", -5.756964206695557], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them multiple times.", -5.938058853149414], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them except the last one.", -6.426080703735352], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them except the last two.", -7.013882637023926], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them multiple times. Have you read them all?", -7.088461399078369], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them multiple times. Have you ever read them?", -7.318304061889648], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them multiple times. Have you read them?", -7.324375152587891], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them multiple times. Have you read any other books?", -7.593523979187012], ["Harry potter and the prisoner of azkaban is my favorite book. I have read all of them except the last one. Have you read them?", -8.003595352172852]], "metrics": {"clen": 1031.0, "ctrunc": 1.0, "ctrunclen": 903.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I have never read that one. I will have to check it out. I have heard good things about it.", "beam_texts": [["I have never read that one. I will have to check it out. I have heard good things about it.", -6.769777774810791], ["I have never read that one. I will have to check it out. Do you read any other books?", -6.937473297119141], ["I haven't read that one either. I will have to check it out. Do you read a lot of books?", -7.26310920715332], ["I haven't read that one either. I will have to check it out. Do you read a lot?", -7.3068389892578125], ["I haven't read that one either. I will have to check it out. Do you read any other books?", -7.350712299346924], ["I haven't read that one either. I will have to check it out. Do you read a lot of other books?", -7.6869797706604], ["I have never read that one. I will have to check it out. I have heard good things about it. What do you like about it?", -7.695240020751953], ["I have never read that one. I will have to check it out. I have heard good things about it. What do you like most about it?", -7.941776275634766], ["I haven't read that one either. I will have to check it out. Do you read a lot of other books as well?", -8.03442668914795], ["I have never read that one. I will have to check it out. I have heard good things about it. Have you read all of her books?", -8.284603118896484]], "metrics": {"clen": 1072.0, "ctrunc": 1.0, "ctrunclen": 944.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite harry potter book? I like all of them, but the deathly hallows is my favorite.", "beam_texts": [["Do you have a favorite harry potter book? I like all of them, but the deathly hallows is my favorite.", -7.614919185638428], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows is probably my favorite.", -8.195989608764648], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows was my favorite.", -8.303483009338379], ["Do you have a favorite harry potter book? I like all of them, but the last one is my favorite.", -8.306302070617676], ["Do you have a favorite harry potter book? I like all of them but I think the deathly hallows is my favorite.", -8.347549438476562], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows is my favorite one.", -8.364377975463867], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows part 2 is my favorite.", -8.473535537719727], ["Do you have a favorite harry potter book? I like all of them, but the last one was my favorite.", -8.600378036499023], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows book is my favorite.", -8.604009628295898], ["Do you have a favorite harry potter book? I like all of them, but the deathly hallows is my favorite", -8.707847595214844]], "metrics": {"clen": 1078.0, "ctrunc": 1.0, "ctrunclen": 950.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like that one too. I also like the one where they go to hogwarts.", "beam_texts": [["I like that one too. I also like the one where they go to hogwarts.", -6.4302659034729], ["I like that one too. I also really like the one where they go to hogwarts.", -6.822723865509033], ["I like that one as well. I also like the one where they go to hogwarts.", -6.832738399505615], ["I like that one too. I also like the one where they go to hogwarts for the first time.", -7.033507823944092], ["I like that one too. I also like the one where they go to hogwarts", -7.599310398101807], ["I like that one too. I also like the one where they go to hogwarts. I think it is the first one.", -8.151132583618164], ["I like that one too. I also really like the one where they go to hogwarts. I think it is the first one.", -8.381620407104492], ["I like that one as well. I also like the one where they go to hogwarts. I think it is the first one.", -8.475436210632324], ["I like that one too. I also like the one where they go to hogwarts for the first time. I think that was the first one.", -9.231624603271484], ["I like that one too. I also like the one where they go to hogwarts for the first time. I think it was the first one.", -9.299555778503418], ["I like that one too. I also like the one where they go to hogwarts for the first time. I think that was the first book.", -9.414134979248047], ["I like that one too. I also like the one where they go to hogwarts for the first time. I think it was the first book.", -9.521150588989258]], "metrics": {"clen": 1126.0, "ctrunc": 1.0, "ctrunclen": 998.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Oh yeah, that one was good too. Do you like any other books by j.k. Rowling?", "beam_texts": [["Oh yeah, that one was good too. Do you like any other books by j.k. Rowling?", -7.4132184982299805], ["Oh yeah, that one was good too. Do you like any other books by j. K. Rowling?", -7.583545207977295], ["Oh yeah, that one was good too. Do you like any of the other books in the series?", -8.011695861816406], ["Oh yeah, that one was good too. Do you like any other books by j.K. Rowling?", -8.257349967956543], ["Oh yeah, that one was good too. Do you like any other books by jk rowling?", -8.345537185668945], ["Oh yeah, that one was good too. Do you like any other books by j.k rowling?", -8.452038764953613], ["Oh yeah, that one was good too. Do you like any of the other books in the series, or just that one?", -8.62160873413086], ["Oh yeah, that one was good too. Do you like any other books by j.k. rowling?", -8.646706581115723], ["Oh yeah, that one was good too. Do you like any other books by j.k. Rowling? I really like the hobbit.", -9.299732208251953], ["Oh yeah, that one was good too. Do you like any other books by j.k. Rowling? I really like her books.", -9.527886390686035]], "metrics": {"clen": 1130.0, "ctrunc": 1.0, "ctrunclen": 1002.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "No, I haven't read any of her other books. What is your favorite book of hers?", "beam_texts": [["No, I haven't read any of her other books. What is your favorite book of hers?", -5.646121501922607], ["No, I haven't read any of her other books. What is your favorite book by her?", -5.932474613189697], ["I haven't read any of her other books, but I would like to. What is your favorite book?", -6.282103538513184], ["I haven't read any of her other books, but I would like to. What is your favorite?", -6.3752851486206055], ["I haven't read any of her other books, but I would like to. What is your favorite book by her?", -6.5020222663879395], ["I haven't read any of her other books, but I have seen the movies. They were pretty good.", -6.617175579071045], ["No, I haven't read any of her other books. What is your favorite book of her's?", -6.686893463134766], ["I haven't read any of her other books, but I would like to. What is your favorite one?", -6.741934776306152], ["I haven't read any of her other books, but I would like to read them. What is your favorite book?", -6.8888020515441895], ["I haven't read any of her other books, but I would like to read them. What is your favorite?", -7.111107349395752]], "metrics": {"clen": 1175.0, "ctrunc": 1.0, "ctrunclen": 1047.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter and the prisoner of azkaban. Have you ever read it?", "beam_texts": [["Harry potter and the prisoner of azkaban. Have you ever read it?", -4.0534210205078125], ["Harry potter and the prisoner of azkaban is the best book in the series.", -4.398553848266602], ["Harry potter and the prisoner of azkaban is my all time favorite book.", -4.437891006469727], ["Harry potter and the prisoner of azkaban is my all time favorite. Have you read it?", -4.743660926818848], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you read it?", -4.940860748291016], ["Harry potter and the prisoner of azkaban is my all time favorite. Have you ever read it?", -4.946752548217773], ["Harry potter and the prisoner of azkaban. It was the first one I read.", -5.132210731506348], ["Harry potter and the prisoner of azkaban is the best book in the series. Have you ever read it?", -5.288331508636475], ["Harry potter and the prisoner of azkaban. It was the first one I read and I loved it.", -5.33373498916626], ["Harry potter and the prisoner of azkaban. It was the first one I read and I was hooked.", -5.522300720214844], ["Harry potter and the prisoner of azkaban. It was the first one I read and I was hooked!", -5.908141613006592], ["Harry potter and the prisoner of azkaban. It was the first one I read and I loved it!", -6.00941801071167]], "metrics": {"clen": 1179.0, "ctrunc": 1.0, "ctrunclen": 1051.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I have not read that one, but I have seen the movie. It is one of my favorites.", "beam_texts": [["I have not read that one, but I have seen the movie. It is one of my favorites.", -7.013105869293213], ["I have not read that one, but I have seen the movie. It is one of my favorite movies.", -7.176651954650879], ["I have not read that one, but I have heard of it. Is it a good book?", -7.288233757019043], ["I have not read that one, but I have heard of it. Is it a good one?", -7.315263271331787], ["I have not read that one, but I have heard of it. Is it your favorite of her books?", -7.371372222900391], ["I have not read that one, but I have seen the movie. It is one of my favorites!", -7.395170211791992], ["I have not read that one, but I have seen the movie. It is a good one.", -7.520087718963623], ["I have not read that one, but I have seen the movie. It is one of my favorite movies!", -7.617950916290283], ["I have not read that one, but I have seen the movie. It is a great movie.", -7.758055210113525], ["I have not read that one, but I have seen the movie. It is a good one!", -7.90666389465332]], "metrics": {"clen": 1220.0, "ctrunc": 1.0, "ctrunclen": 1092.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite harry potter book? Mine is the goblet of fire.", "beam_texts": [["Do you have a favorite harry potter book? Mine is the goblet of fire.", -5.30488395690918], ["Do you have a favorite harry potter book? My favorite is the goblet of fire.", -5.773291110992432], ["Do you have a favorite harry potter book? I like the goblet of fire.", -5.794121265411377], ["Do you have a favorite harry potter book? I think mine is the goblet of fire.", -5.825507640838623], ["Do you have a favorite harry potter book? I think mine is goblet of fire.", -5.88191556930542], ["Do you have a favorite harry potter book? I really like the goblet of fire.", -6.051637172698975], ["Do you have a favorite harry potter book? I like the goblet of fire the best.", -6.45910120010376], ["Do you have a favorite harry potter book? I like the goblet of fire the most.", -6.4798078536987305], ["Do you have a favorite harry potter book? I think mine is the goblet of fire", -6.680726528167725], ["Do you have a favorite harry potter book? My favorite is the goblet of fire", -6.697775840759277]], "metrics": {"clen": 1225.0, "ctrunc": 1.0, "ctrunclen": 1097.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like that one too. I like all of them, but the first one is my favorite.", "beam_texts": [["I like that one too. I like all of them, but the first one is my favorite.", -6.671021461486816], ["I like that one too. I like all of them, but the first one is definitely my favorite.", -7.086752891540527], ["I like that one as well. I like all of them, but the first one is my favorite.", -7.168520927429199], ["I like that one too. I like all of them, but the first one is probably my favorite.", -7.407092571258545], ["I like that one as well. I like all of them, but the first one is definitely my favorite.", -7.479731559753418], ["I like that one too. I like all of them, but the first one is the best.", -7.536286354064941], ["I like that one too. I like all of them, but the first one is definitely the best.", -7.614798069000244], ["I like that one as well. I like all of them, but the first one is my favorite. It was the first book I read.", -9.226434707641602], ["I like that one too. I like all of them, but the first one is my favorite. I love the whole series.", -9.262956619262695], ["I like that one as well. I like all of them, but the first one is my favorite. It was the first I read.", -9.43016242980957]], "metrics": {"clen": 1266.0, "ctrunc": 1.0, "ctrunclen": 1138.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I agree. The first book is always the best. I wish I could go back in time and read it for the first time again.", "beam_texts": [["I agree. The first book is always the best. I wish I could go back in time and read it for the first time again.", -7.933029651641846], ["I agree. The first book is always the best. I wish I could go back and read it for the first time again.", -8.102033615112305], ["I agree. The first book is always the best. I wish I could go back in time and read it again for the first time.", -8.14632797241211], ["I agree. The first book is always the best. I wish I could go back in time and read them again for the first time.", -8.161346435546875], ["I agree. The first book is always the best. I wish I could go back and read it again for the first time.", -8.23382568359375], ["I agree. The first book is always the best. I wish they would make a movie out of it.", -8.497220993041992], ["I agree. The first book is always the best. I wish I could go back in time and read it for the first time.", -8.56592845916748], ["I agree. The first book is always the best. I wish I could go back in time and read it for the first time again!", -8.773022651672363], ["I agree. The first book is always the best. I wish I could go back and read it for the first time.", -8.781147956848145], ["I agree. The first book is always the best. I wish they would make a movie out of that one.", -8.858370780944824], ["I agree. The first book is always the best. I wish I could go back and read it for the first time again!", -8.89818000793457], ["I agree. The first book is always the best. I wish they would make a movie out of that book.", -8.92681884765625]], "metrics": {"clen": 1269.0, "ctrunc": 1.0, "ctrunclen": 1141.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "That would be awesome. I would love to be able to go back and read the first book again. It's been so long since I've read it.", "beam_texts": [["That would be awesome. I would love to be able to go back and read the first book again. It's been so long since I've read it.", -9.474871635437012], ["That would be awesome. I would love to be able to go back and read the first book again. It's been so long since I read it.", -9.70594310760498], ["That would be awesome. I would love to be able to go back and read the first book again. It's been so long since I have read it.", -9.932372093200684], ["That would be awesome. I would love to be able to go back and read the first book again. Do you like any other books?", -9.968094825744629], ["That would be awesome. I would love to be able to go back and read the first book again. It's been so long since I've read them.", -10.024548530578613], ["That would be awesome. I would love to be able to go back and read the first book again and see what I missed.", -10.061201095581055], ["That would be awesome. I would love to be able to go back and read the first book again. It's been so long.", -10.093929290771484], ["Yeah, that would be awesome. I would love to go back and read the first book again, but then I would want to read the rest of the series again too.", -10.25864028930664], ["Yeah, that would be awesome. I would love to go back and read the first book again, but then I would want to read the rest of the series.", -10.614871978759766], ["Yeah, that would be awesome. I would love to go back and read the first book again, but then I would want to read the rest of the series again too!", -10.917603492736816]], "metrics": {"clen": 1318.0, "ctrunc": 1.0, "ctrunclen": 1190.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "It has been a long time for me as well. I think it is time for a re-read.", "beam_texts": [["It has been a long time for me as well. I think it is time for a re-read.", -7.373985767364502], ["It has been a long time for me as well. I think I will read it again soon.", -7.528759956359863], ["It has been a long time for me as well. I think I will re-read it soon.", -7.585983753204346], ["It has been a long time for me as well. I think it is time for a reread.", -7.588926315307617], ["It has been a long time for me as well. I think I will reread it soon.", -7.682298183441162], ["It has been a long time for me as well. I need to re-read it soon.", -7.791104793548584], ["It has been a long time for me as well. I think it is time for a re-read!", -7.893913745880127], ["It has been a long time for me as well. I think I will re-read it this weekend.", -7.980367660522461], ["It has been a long time for me as well. I need to re-read the whole series.", -8.025958061218262], ["It has been a long time for me as well. I think I will re-read it this summer.", -8.126288414001465]], "metrics": {"clen": 1333.0, "ctrunc": 1.0, "ctrunclen": 1205.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I think you're right. I'll have to see if I can find the books at the library.", "beam_texts": [["I think you're right. I'll have to see if I can find the books at the library.", -7.562309741973877], ["I think you're right. I'll have to see if I can find a copy of it.", -7.791215896606445], ["I think you're right. I'll have to see if I can find the books at my library.", -7.910104274749756], ["I think you're right. I'll have to see if I can find the time to do so.", -7.954026222229004], ["I think you're right. I'll have to see if I can find the time to do it.", -8.002554893493652], ["I think you're right. I'll have to see if I can find a copy of the book.", -8.003856658935547], ["I think you're right. I'll have to see if my library has it. I'm sure they do.", -8.01504135131836], ["I think you're right. I'll have to see if my library has it. Do you have any other favorite books?", -8.043862342834473], ["I think you're right. I'll have to see if my library has it. Do you have any other recommendations?", -8.28970718383789], ["I think you're right. I'll have to see if my library has it. Do you have a favorite book?", -8.388486862182617]], "metrics": {"clen": 1376.0, "ctrunc": 1.0, "ctrunclen": 1248.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "If you can't find them, you can always buy them on amazon. That is what I do.", "beam_texts": [["If you can't find them, you can always buy them on amazon. That is what I do.", -7.705251693725586], ["If you can't find them, you can always buy them on amazon. That's what I do.", -7.756148338317871], ["If you can't find them, you can always borrow them from the public library. I do that all the time.", -7.879583358764648], ["If you can't find them, you can always buy them on amazon. That's what I did.", -8.152722358703613], ["If you can't find them, you can always buy them on amazon. That is what I usually do.", -8.154193878173828], ["If you can't find them, you can always buy them on amazon. That's what I usually do.", -8.223387718200684], ["If you can't find them, you can always buy them on amazon. That is what I did.", -8.275824546813965], ["If you can't find them, you can always buy them on amazon. That's what I did when I couldn't find mine.", -8.757267951965332], ["If you can't find them, you can always borrow them from the public library. I do that all the time with my books.", -8.826165199279785], ["If you can't find them, you can always borrow them from the public library. I do that all the time!", -8.852282524108887], ["If you can't find them, you can always borrow them from the public library. I do that all the time with my kids.", -8.897374153137207]], "metrics": {"clen": 1380.0, "ctrunc": 1.0, "ctrunclen": 1252.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "That's a good idea. I don't know why I didn't think of that. Thanks!", "beam_texts": [["That's a good idea. I don't know why I didn't think of that. Thanks!", -5.508181095123291], ["That's a good idea. I don't know why I didn't think of that. Thanks for the tip!", -5.979549407958984], ["That's a good idea. I don't know why I didn't think of that. Do you like to read?", -6.026525974273682], ["That's a good idea. I don't know why I didn't think of that. Thanks for the suggestion!", -6.036716461181641], ["That's a good idea. I don't know why I didn't think of that. Thanks for the suggestion.", -6.109391212463379], ["That's a good idea. I don't know why I didn't think of that. Thanks for the tip.", -6.298360824584961], ["That's a good idea. I don't know why I didn't think of that. Thanks for the advice!", -6.333670139312744], ["That's a good idea. I don't know why I didn't think of that. Do you have any other hobbies?", -6.479755878448486], ["That's a good idea. I don't know why I didn't think of that. Do you have a favorite book?", -6.543719291687012], ["That's a good idea. I don't know why I didn't think of that. Do you have any other books you recommend?", -6.749739646911621], ["That's a good idea. I don't know why I didn't think of that. Do you have any other books to recommend?", -6.858697414398193], ["That's a good idea. I don't know why I didn't think of that. Do you have any other books you like?", -7.029028415679932]], "metrics": {"clen": 1423.0, "ctrunc": 1.0, "ctrunclen": 1295.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "You are very welcome. I hope you can find them and enjoy them as much as I do!", "beam_texts": [["You are very welcome. I hope you can find them and enjoy them as much as I do!", -6.878462314605713], ["You are very welcome. I hope you enjoy the books as much as I did when I was your age.", -7.099313735961914], ["You are very welcome. I hope you can find them and enjoy them as much as I have.", -7.181569576263428], ["You are very welcome. I hope you can find them and enjoy them as much as I did.", -7.206268787384033], ["You are very welcome. I hope you enjoy the books as much as I did when I was reading them.", -7.223011493682861], ["You are very welcome. I hope you enjoy the books as much as I did when you read them.", -7.257277488708496], ["You are very welcome. I hope you enjoy the books as much as I did when I was a kid.", -7.267088413238525], ["You are very welcome. I hope you enjoy the books as much as I did when I read them.", -7.323046684265137], ["You are very welcome. I hope you enjoy the books as much as I did when I was a child.", -7.410288333892822], ["You are very welcome. I hope you enjoy the books as much as I did when I was your age!", -7.814503192901611], ["You are very welcome. I hope you enjoy the books as much as I did when I was a kid!", -7.984873294830322]], "metrics": {"clen": 1426.0, "ctrunc": 1.0, "ctrunclen": 1298.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I'm sure I will. Have you read any of the harry potter books? I've only seen the movies.", "beam_texts": [["I'm sure I will. Have you read any of the harry potter books? I've only seen the movies.", -6.426520347595215], ["I'm sure I will. Do you have a favorite harry potter book? I've only seen the movies.", -6.6682000160217285], ["I'm sure I will. Do you have a favorite harry potter book? I like the first one.", -6.802425861358643], ["I'm sure I will. Have you read any of the harry potter books? I've never read them.", -6.97183084487915], ["I'm sure I will. Have you read any of the harry potter books? I haven't.", -6.991204261779785], ["I'm sure I will. Have you read any of the harry potter books? I haven't yet.", -7.0139479637146], ["I'm sure I will. Have you read any of the harry potter books? I haven't read any yet.", -7.086680889129639], ["I'm sure I will. Have you read any of the harry potter books? I haven't read any.", -7.267045497894287], ["I'm sure I will. Have you read any of the harry potter books? I haven't read them yet.", -7.298332691192627], ["I'm sure I will. Have you read any of the harry potter books? I've only seen the movies", -7.422105312347412]], "metrics": {"clen": 1467.0, "ctrunc": 1.0, "ctrunclen": 1339.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I have read all of them except for the last one. I haven't gotten around to it yet.", "beam_texts": [["I have read all of them except for the last one. I haven't gotten around to it yet.", -7.126314640045166], ["I have read all of them except for the last one. I haven't gotten around to reading it yet.", -7.209863185882568], ["I have read all of them except for the last one. I haven't seen the last movie yet.", -7.306796073913574], ["Yes, I have read all of them. They are my favorite books of all time. Do you have a favorite book?", -7.522154808044434], ["I have read all of them except for the last one. I haven't had time to read lately.", -7.669784069061279], ["Yes, I have read all of them. They are my favorite books of all time. Do you have a favorite movie?", -7.782526969909668], ["I have read all of them except for the last one. I haven't had the time to read lately.", -7.931119918823242], ["Yes, I have read all of them. They are my favorite books of all time. Do you have a favorite character?", -8.110538482666016], ["Yes, I have read all of them. They are my favorite books of all time. Do you have any other books you like?", -8.226715087890625], ["Yes, I have read all of them. They are my favorite books of all time. Do you have any other books you enjoy?", -8.305752754211426]], "metrics": {"clen": 1475.0, "ctrunc": 1.0, "ctrunclen": 1347.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Do you have any other books you'd recommend? I'm always looking for something new to read.", "beam_texts": [["Do you have any other books you'd recommend? I'm always looking for something new to read.", -6.809309005737305], ["Do you have any other books you'd recommend? I'm always looking for new ones to read.", -7.005115985870361], ["Do you have any other books you'd recommend? I'm always looking for new books to read.", -7.039082050323486], ["Do you have any other books you'd recommend? I'm always looking for something new to read!", -7.924262046813965], ["Do you have any other books you'd recommend? I'm always looking for new books to read!", -8.092472076416016], ["Do you have any other books you'd recommend? I'm always looking for new ones to read!", -8.103189468383789], ["Do you have any other books you'd recommend? I'm always looking for something new to read. I've been reading a lot of mystery books lately.", -9.723114013671875], ["Do you have any other books you'd recommend? I'm always looking for new books to read. I've been reading a lot of mystery books lately.", -9.80496597290039], ["Do you have any other books you'd recommend? I'm always looking for new ones to read. I've been reading a lot of mystery books lately.", -9.818350791931152], ["Do you have any other books you'd recommend? I'm always looking for something new to read. I've been looking for a new book to read myself.", -10.027591705322266]], "metrics": {"clen": 1517.0, "ctrunc": 1.0, "ctrunclen": 1389.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is one of my favorites.", "beam_texts": [["Harry potter and the prisoner of azkaban is one of my favorites.", -3.942601203918457], ["Harry potter and the prisoner of azkaban is my favorite of the series.", -4.230422019958496], ["Harry potter and the prisoner of azkaban is my all time favorite book.", -4.559414863586426], ["Harry potter and the prisoner of azkaban is one of my favorites. What is your favorite book?", -4.895418167114258], ["Harry potter and the prisoner of azkaban is one of my favorites. What is your favorite?", -5.169732570648193], ["Harry potter and the prisoner of azkaban is one of my favorites. I would recommend that one.", -5.236782550811768], ["Harry potter and the prisoner of azkaban is one of my favorites. What is your favorite one?", -5.3229827880859375], ["Harry potter and the prisoner of azkaban is one of my favorites. I also really like the hobbit.", -5.913050651550293], ["Harry potter and the prisoner of azkaban is one of my favorites. It has a lot of action.", -6.240228176116943], ["Harry potter and the prisoner of azkaban is one of my favorites. I also really like the hobbit series.", -6.422975540161133]], "metrics": {"clen": 1520.0, "ctrunc": 1.0, "ctrunclen": 1392.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I'll have to check that one out. I've heard a lot of good things about it.", "beam_texts": [["I'll have to check that one out. I've heard a lot of good things about it.", -6.089206695556641], ["I'll have to check that one out. I've heard a lot of good things about that one.", -6.711606979370117], ["I'll have to check that one out. I've heard a lot of good things about that book.", -6.714302062988281], ["I'll have to check that one out. I've heard a lot of good things about it. What's it about?", -7.058640480041504], ["I'll have to check that one out. I've heard a lot of good things about it!", -7.114068984985352], ["I'll have to check that one out. I've heard a lot of good things about it, but I've never read it.", -7.4320549964904785], ["I'll have to check that one out. I've heard a lot of good things about it, but I've never read it myself.", -7.578122615814209], ["I'll have to check that one out. I've heard a lot of good things about it. What's your favorite part of the book?", -7.756246089935303], ["I'll have to check that one out. I've heard a lot of good things about it. What's your favorite part about it?", -7.812376976013184], ["I'll have to check that one out. I've heard a lot of good things about it. What's your favorite part of the series?", -7.905927658081055], ["I'll have to check that one out. I've heard a lot of good things about it. What's your favorite part?", -8.015447616577148], ["I'll have to check that one out. I've heard a lot of good things about it. Do you think you'll ever read it?", -8.239410400390625], ["I'll have to check that one out. I've heard a lot of good things about it. Do you think you'll read it again?", -8.261384963989258]], "metrics": {"clen": 1561.0, "ctrunc": 1.0, "ctrunclen": 1433.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I think you would like it. It's about voldemort and the death eaters.", "beam_texts": [["I think you would like it. It's about voldemort and the death eaters.", -7.165413856506348], ["I think you would like it. It's about a wizard who is sent to prison.", -8.171727180480957], ["I think you would like it. It's about a wizard and a muggle in prison.", -8.239601135253906], ["I think you would like it. It's about a wizard and a muggle.", -8.30289077758789], ["I think you would like it. It's about a wizard and a muggle in a magical prison.", -8.556412696838379], ["I think you would like it. It's about a wizard and a muggle in a magical world.", -8.697905540466309], ["I think you would like it. It's about a wizard and a muggle in a prison.", -8.709972381591797], ["I think you would like it. It's about a wizard and a muggle who are friends.", -8.936023712158203], ["I think you would like it. It's about a wizard and a muggle in a magical school.", -9.059883117675781], ["I think you would like it. It's about a wizard and a muggle living in the same neighborhood.", -9.182973861694336], ["I think you would like it. It's about a wizard and a muggle living in the same house.", -9.254615783691406]], "metrics": {"clen": 1564.0, "ctrunc": 1.0, "ctrunclen": 1436.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "That sounds like it would be a good read. I'll check it out next time I'm at the library.", "beam_texts": [["That sounds like it would be a good read. I'll check it out next time I'm at the library.", -6.7431511878967285], ["That sounds like it would be a good read. I'll check it out next time I'm at the bookstore.", -6.875016689300537], ["That sounds like it would be a good read. I'll check it out next time I go to the library.", -6.9213361740112305], ["That sounds like it would be a good read. I'll check it out next time I go to the bookstore.", -7.102486610412598], ["That sounds like it would be a good read. I think I'll check it out next time I'm at the library.", -7.145380020141602], ["That sounds like it would be a good read. I think I'll check it out next time I go to the library.", -7.234342575073242], ["That sounds like it would be a good read. I'll check it out next time I'm at the book store.", -7.264858245849609], ["That sounds like it would be a good read. I'll check it out next time I go to the book store.", -7.384548664093018], ["That sounds like it would be a good read. I'm going to have to add it to my list.", -7.4509711265563965], ["That sounds like it would be a good read. I'll check it out next time I'm at the bookstore!", -7.814091682434082]], "metrics": {"clen": 1605.0, "ctrunc": 1.0, "ctrunclen": 1477.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I hope you like it as much as I do. What is your favorite harry potter book?", "beam_texts": [["I hope you like it as much as I do. What is your favorite harry potter book?", -5.939067363739014], ["I hope you like it as much as I do. What's your favorite harry potter book?", -5.943094730377197], ["I hope you like it as much as I do. Do you like harry potter at all?", -7.019011497497559], ["I hope you like it as much as I do. Do you like harry potter as well?", -7.086021900177002], ["I hope you like it as much as I do. Do you like harry potter too?", -7.211577415466309], ["I hope you like it as much as I do. What is your favorite book of all time?", -7.455715179443359], ["I hope you like it as much as I do. Do you like harry potter books?", -7.512543678283691], ["I hope you like it as much as I do. What's your favorite harry potter novel?", -7.605163097381592], ["I hope you like it as much as I do. What is your favorite harry potter book.", -7.834551811218262], ["I hope you like it as much as I do. What is your favorite harry potter book? Mine is goblet of fire", -8.292906761169434], ["I hope you like it as much as I do. What's your favorite harry potter book? Mine is goblet of fire", -8.293121337890625]], "metrics": {"clen": 1611.0, "ctrunc": 1.0, "ctrunclen": 1483.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I don't have a favorite book, but my favorite character is harry. Do you like harry?", "beam_texts": [["I don't have a favorite book, but my favorite character is harry. Do you like harry?", -7.5211405754089355], ["I would have to say the first one. It was the first book I ever read and I loved it.", -7.837216377258301], ["I would have to say the first one. It was the first book I read in the series and I loved it.", -7.9175615310668945], ["I would have to say the first one. It was the first book I read when I was a kid.", -7.935768127441406], ["I would have to say the first one. It was the first book I read in the series.", -7.958656311035156], ["I would have to say the first one. It was the first book I read when I was a kid and I loved it.", -8.03988265991211], ["I would have to say the first one. It was the first book I read when I was a kid and I've loved it ever since.", -8.084758758544922], ["I would have to say the first one. It was the first book I read when I was younger.", -8.258658409118652], ["I would have to say the first one. It was the first book I read when I was a kid and it has always been my favorite.", -8.258740425109863], ["I would have to say the first one. It was the first book I read when I was a kid and it really got me into reading.", -8.435905456542969], ["I would have to say the first one. It was the first book I read when I was a kid and I loved it ever since.", -8.531851768493652]], "metrics": {"clen": 1653.0, "ctrunc": 1.0, "ctrunclen": 1525.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I love harry! I think he is the best character in the series. I also love goblet of fire.", "beam_texts": [["I love harry! I think he is the best character in the series. I also love goblet of fire.", -8.67579460144043], ["I love harry! I think he is the best character in the series. I also love the goblet of fire.", -8.751447677612305], ["I love harry! I think he is the best character in the book. I also love the goblet of fire.", -8.871623039245605], ["I love harry! I think he is the best character in the series. I also love the goblet of fire book.", -9.163790702819824], ["I love harry! I think he is the best character in the whole series. I also love the goblet of fire.", -9.20134449005127], ["I love harry! I think he is the best character in the series. I also like dudley.", -9.319595336914062], ["I love harry! I think he is the best character in the series. I also love the movies.", -9.619236946105957], ["I love harry! I think he is the best character in the series. I also love the books.", -9.909436225891113], ["I love harry! I think he is the best character in the series. I also love the goblet of fire. It is my favorite.", -9.922515869140625], ["I love harry! I think he is the best character in the series. I also love the goblet of fire. It is so good.", -10.196023941040039]], "metrics": {"clen": 1658.0, "ctrunc": 1.0, "ctrunclen": 1530.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "My favorite book is the prisoner of azkaban. Have you read that one?", "beam_texts": [["My favorite book is the prisoner of azkaban. Have you read that one?", -5.055629253387451], ["My favorite book is the prisoner of azkaban. What's your favorite book?", -5.1348161697387695], ["My favorite book is the prisoner of azkaban. Have you ever read it?", -5.323230743408203], ["My favorite book is the prisoner of azkaban by j. K. Rowling.", -5.669863700866699], ["My favorite book is the prisoner of azkaban. Have you ever read that one?", -5.68938684463501], ["My favorite book is the prisoner of azkaban by j. K. Rowling", -5.9045257568359375], ["My favorite book is the prisoner of azkaban. Have you read that one yet?", -5.925577163696289], ["My favorite book is the prisoner of azkaban. What's your favorite one?", -5.950758934020996], ["My favorite book is the prisoner of azkaban. Have you read it yet?", -6.130620956420898], ["My favorite book is the prisoner of azkaban. Have you read that book?", -6.246408939361572]], "metrics": {"clen": 1704.0, "ctrunc": 1.0, "ctrunclen": 1576.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "No, I haven't. Is that the one where harry goes to hogwarts?", "beam_texts": [["No, I haven't. Is that the one where harry goes to hogwarts?", -6.224245548248291], ["No, I haven't. Is that the one where harry goes to hogwarts for the first time?", -6.922926425933838], ["No, I haven't. Is that the one where harry goes to prison for a crime he didn't commit?", -7.371138095855713], ["No, I haven't. Is that the one where harry is in prison for a crime he didn't commit?", -7.527276039123535], ["No, I haven't. Is that the one where harry is in prison for the first time?", -7.757878303527832], ["No, I haven't. Is that the one where harry goes to prison for a year?", -7.882017135620117], ["No, I haven't. Is that the one where harry goes to hogwarts? I think that is my favorite book.", -8.038497924804688], ["No, I haven't. Is that the one where harry goes to hogwarts? I think that's my favorite book.", -8.293139457702637], ["No, I haven't. Is that the one where harry goes to hogwarts? I think that is my favorite one.", -8.35765266418457], ["No, I haven't. Is that the one where harry goes to hogwarts? I think that is my favorite.", -8.45097827911377], ["No, I haven't. Is that the one where harry goes to hogwarts? I think that is the first book.", -8.68170166015625]], "metrics": {"clen": 1707.0, "ctrunc": 1.0, "ctrunclen": 1579.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Yes, that's the one. It's one of my favorites. What's your favorite book?", "beam_texts": [["Yes, that's the one. It's one of my favorites. What's your favorite book?", -6.902357578277588], ["Yes, that's the one. It's one of my favorites. What's your favorite?", -7.122979164123535], ["Yes, that's the one. It's one of my favorites. What's your favorite one?", -7.2432355880737305], ["Yes, that's the one. It's one of my favorites as well. What's your favorite book?", -7.4070725440979], ["Yes, that's the one. It's one of my favorites as well. What's your favorite?", -7.725705623626709], ["Yes, that's the one. It's one of my favorites. What's your favorite book of the series?", -7.835805892944336], ["Yes, that's the one. It's one of my favorites. What's your favorite character?", -7.8656392097473145], ["Yes, that's the one. It's one of my favorites as well. What's your favorite one?", -7.871669292449951], ["Yes, that's the one. It's one of my favorites as well. What's your favorite character?", -8.248242378234863], ["Yes, that's the one. It's one of my favorites as well. What's your favorite book then?", -8.607479095458984]], "metrics": {"clen": 1749.0, "ctrunc": 1.0, "ctrunclen": 1621.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Harry potter is my favorite book of all time. I've read it so many times that I can recite it from memory.", "beam_texts": [["Harry potter is my favorite book of all time. I've read it so many times that I can recite it from memory.", -8.457925796508789], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite it word for word.", -8.464521408081055], ["Harry potter is my favorite book of all time. I love it so much. What is your favorite?", -8.524333000183105], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite it from start to finish.", -8.54776382446289], ["Harry potter is my favorite book of all time. I've read it so many times I can recite it from memory.", -8.559877395629883], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite most of it from memory.", -8.630382537841797], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite the entire book from memory.", -8.67013168334961], ["Harry potter is my favorite book of all time. I love it so much. What is your favorite movie?", -8.705519676208496], ["Harry potter is my favorite book of all time. I've read it so many times that I've lost count.", -8.761470794677734], ["Harry potter is my favorite book of all time. I've read it so many times I can recite it by heart.", -8.841617584228516], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite most of it by heart.", -8.848837852478027], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite the whole thing from memory.", -8.866297721862793], ["Harry potter is my favorite book of all time. I've read it so many times that I can't count.", -8.919031143188477], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite it word for word!", -9.070355415344238], ["Harry potter is my favorite book of all time. I've read it so many times that I can recite it from start to finish!", -9.174152374267578]], "metrics": {"clen": 1753.0, "ctrunc": 1.0, "ctrunclen": 1625.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Do you have a favorite character in harry potter? I like harry and his friends.", "beam_texts": [["Do you have a favorite character in harry potter? I like harry and his friends.", -7.060178279876709], ["Do you have a favorite character in harry potter? I like hermione a lot.", -7.234704494476318], ["Do you have a favorite character from harry potter? I like harry and his friends.", -7.304649829864502], ["Do you have a favorite character in harry potter? I like hermione granger.", -7.317358016967773], ["Do you have a favorite character in harry potter? I really like harry and his friends.", -7.395308971405029], ["Do you have a favorite character in harry potter? I like harry and his friends a lot.", -7.502577781677246], ["Do you have a favorite character in harry potter? I like harry and his friends a lot", -8.647903442382812], ["Do you have a favorite character in harry potter? I like harry and his friends a lot. Do you like any other books?", -8.915026664733887], ["Do you have a favorite character in harry potter? I like harry and his friends a lot. Do you like the movies?", -9.370142936706543], ["Do you have a favorite character in harry potter? I like harry and his friends, but I'm not sure who my favorite is", -9.940722465515137]], "metrics": {"clen": 1801.0, "ctrunc": 1.0, "ctrunclen": 1673.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My favorite character is hufflepuff. Do you like any of the characters in the books?", "beam_texts": [["My favorite character is hufflepuff. Do you like any of the characters in the books?", -7.9535908699035645], ["My favorite character is hufflepuff. Do you like any of the characters in the book?", -7.982874870300293], ["My favorite character is hufflepuff. Do you like any other characters in the books?", -8.03499698638916], ["My favorite character is hufflepuff. Do you like any other characters in the book?", -8.065360069274902], ["My favorite character is hufflepuff. Do you like any of the characters in the series?", -8.140024185180664], ["My favorite character is hufflepuff. Do you like any of the other characters in the series?", -8.210409164428711], ["My favorite character is hufflepuff. Do you like any of the other characters in the book?", -8.250673294067383], ["My favorite character is hufflepuff. Do you like any of the other characters in the books?", -8.395633697509766], ["My favorite character is hufflepuff. Do you like any of the other characters in the books or movies?", -9.265686988830566], ["My favorite character is hufflepuff. Do you like any of the other characters in the book or movie?", -9.89888858795166]], "metrics": {"clen": 1804.0, "ctrunc": 1.0, "ctrunclen": 1676.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I don't think I've ever read the books. I'm more of a movie person. Which book is your favorite?", "beam_texts": [["I don't think I've ever read the books. I'm more of a movie person. Which book is your favorite?", -8.109260559082031], ["I don't think I've ever read the books. I'm more of a movie person. Which book is your favorite in the series?", -8.544807434082031], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that you like so much?", -8.639405250549316], ["I don't think I've ever read the books. I'm more of a movie person. What is your favorite movie?", -8.674511909484863], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that makes them your favorite?", -8.730338096618652], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that you like?", -8.784587860107422], ["I don't think I've ever read the books. I'm more of a movie person. What is the book about?", -8.804224014282227], ["I don't think I've ever read the books, but I've seen the movies. I like all the characters.", -8.906603813171387], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books you like?", -8.989171028137207], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that makes you like them?", -9.06501579284668], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that make you like them?", -9.349834442138672], ["I don't think I've ever read the books. I'm more of a movie person. What is it about the books that made you like them?", -9.542502403259277]], "metrics": {"clen": 1846.0, "ctrunc": 1.0, "ctrunclen": 1718.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My favorite book is the prisoner of azkaban. Have you ever read it?", "beam_texts": [["My favorite book is the prisoner of azkaban. Have you ever read it?", -4.004744052886963], ["My favorite book is the prisoner of azkaban. Have you read that one?", -4.01716947555542], ["My favorite book is the prisoner of azkaban. Have you ever read that one?", -4.293135643005371], ["My favorite book is the prisoner of azkaban. Have you seen the movies?", -4.692446231842041], ["My favorite book is the prisoner of azkaban. Have you seen the movie?", -4.74595832824707], ["My favorite book is the prisoner of azkaban. Have you read that one yet?", -4.799525737762451], ["My favorite book is the prisoner of azkaban. Have you ever seen the movie?", -4.902679443359375], ["My favorite book is the prisoner of azkaban. I also like the goblet of fire.", -4.937651634216309], ["My favorite book is the prisoner of azkaban. I also like the goblet of fire though.", -5.7761993408203125], ["My favorite book is the prisoner of azkaban. I also like the goblet of fire", -5.925178050994873]], "metrics": {"clen": 1854.0, "ctrunc": 1.0, "ctrunclen": 1726.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "No, I haven't read that one. I'll have to check it out. What is it about?", "beam_texts": [["No, I haven't read that one. I'll have to check it out. What is it about?", -5.501001358032227], ["No, I haven't read that one. I'll have to check it out. What's it about?", -5.638941287994385], ["No, I haven't read that one. I'll have to check it out sometime. What is it about?", -6.077428817749023], ["No, I haven't read that one either. I'll have to check it out. What is it about?", -6.123248100280762], ["No, I haven't read that one. I'll have to check it out sometime. What's it about?", -6.222938060760498], ["No, I haven't read that one. I'll have to check it out sometime. What do you do for a living?", -6.766294479370117], ["No, I haven't read that one. I'll have to check it out. What's your favorite movie?", -6.812617301940918], ["No, I haven't read that one. I'll have to check it out sometime. What do you like about the book?", -7.100247383117676], ["No, I haven't read that one. I'll have to check it out sometime. What do you do for fun?", -7.3342742919921875], ["No, I haven't read that one. I'll have to check it out sometime. What do you like most about the book?", -7.415767669677734], ["No, I haven't read that one. I'll have to check it out sometime. What do you like most about that book?", -7.527993679046631]], "metrics": {"clen": 1895.0, "ctrunc": 1.0, "ctrunclen": 1767.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "It's about a prisoner who escapes from prison. It's a really good book.", "beam_texts": [["It's about a prisoner who escapes from prison. It's a really good book.", -7.088582515716553], ["It's about a prisoner who escapes from prison and goes on a journey to kill voldemort.", -7.35329532623291], ["It's about a prisoner who escapes from prison. It's a really good read.", -7.499088764190674], ["It's about a prisoner who escapes from prison. It's really good. What's your favorite movie?", -7.519416332244873], ["It's about a prisoner who escapes from prison. It's really good. What's your favorite book?", -7.64350700378418], ["It's about a prisoner who escapes from prison. It's a really good book!", -7.796263217926025], ["It's about a prisoner who escapes from prison and goes on a journey to find his family.", -8.077836036682129], ["It's about a prisoner who escapes from prison and goes on a journey to kill voldemort", -8.09579086303711], ["It's about a prisoner who escapes from prison and goes on a journey to find his parents.", -8.235302925109863], ["It's about a prisoner who escapes from prison and goes on a journey to kill voldemort!", -8.329075813293457]], "metrics": {"clen": 1900.0, "ctrunc": 1.0, "ctrunclen": 1772.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Oh, that sounds interesting. I might have to read it after I finish the harry potter series.", "beam_texts": [["Oh, that sounds interesting. I might have to read it after I finish the harry potter series.", -6.855140686035156], ["Oh, that sounds interesting. I might have to read it after I'm done with the harry potter series.", -7.503808975219727], ["Oh, that sounds interesting. I might have to read it after I finish harry potter.", -7.580702781677246], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter series I'm reading now.", -7.757035255432129], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter series!", -7.790704727172852], ["Oh, that sounds interesting. I might have to read it after I finish the book I'm reading now.", -7.808000087738037], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter books.", -7.886567115783691], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter series", -7.961376667022705], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter series I'm currently reading.", -7.98161506652832], ["Oh, that sounds interesting. I might have to read it after I finish the harry potter series I'm reading.", -8.184776306152344], ["Oh, that sounds interesting. I might have to read it after I finish harry potter!", -8.352923393249512]], "metrics": {"clen": 1941.0, "ctrunc": 1.0, "ctrunclen": 1813.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "It's really good. Do you have any other books you'd recommend? I'm always looking for new ones to read.", "beam_texts": [["It's really good. Do you have any other books you'd recommend? I'm always looking for new ones to read.", -7.914797782897949], ["It's really good. Do you have any other books you'd recommend? I'm always looking for something new to read.", -7.918609619140625], ["It's really good. Do you have any other books you'd recommend? I'm always looking for new books to read.", -7.942626476287842], ["It's really good. Do you have any other books you would recommend? I'm always looking for new books to read.", -8.054107666015625], ["It's really good. Do you have any other books you'd recommend? I'm always looking for recommendations.", -8.073092460632324], ["It's really good. Do you have any other books you'd recommend? I'm always looking for more to read.", -8.077104568481445], ["It's really good. Do you have any other books you would recommend? I'm always looking for new ones to read.", -8.090444564819336], ["It's really good. Do you have any other books you would recommend? I'm always looking for something new to read.", -8.122381210327148], ["It's really good. Do you have any other books you would recommend? I'm always looking for recommendations.", -8.288219451904297], ["It's really good. Do you have any other books you'd recommend? I'm always looking for something new.", -8.459236145019531], ["It's really good. Do you have any other books you'd recommend? I'm always looking for something new to read", -9.126789093017578], ["It's really good. Do you have any other books you'd recommend? I'm always looking for new ones to read", -9.175148963928223], ["It's really good. Do you have any other books you'd recommend? I'm always looking for new books to read", -9.17689323425293]], "metrics": {"clen": 1946.0, "ctrunc": 1.0, "ctrunclen": 1818.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I don't have a lot of time to read these days, but I really enjoyed the hunger games series.", "beam_texts": [["I don't have a lot of time to read these days, but I really enjoyed the hunger games series.", -7.542490005493164], ["I don't have a lot of time to read these days, but I really liked the hunger games series.", -7.772189140319824], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games trilogy.", -7.987367630004883], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games books.", -8.129806518554688], ["I don't have a lot of time to read these days, but I really liked the hunger games books.", -8.20477294921875], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games.", -8.225095748901367], ["I don't have a lot of time to read these days, but I really liked the hunger games.", -8.291619300842285], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games series. I think you'd like it.", -8.663224220275879], ["I don't have a lot of time to read these days, but I do like to read non-fiction books.", -8.67386245727539], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games series. I think you would like it.", -8.719717025756836], ["I don't have a lot of time to read these days, but I do like to read non-fiction books about history.", -8.724635124206543], ["I don't have a lot of time to read these days, but I really enjoyed the hunger games series. I think you'd like them.", -9.110603332519531]], "metrics": {"clen": 1992.0, "ctrunc": 1.0, "ctrunclen": 1864.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I've heard good things about that series, but never got around to reading it. Maybe I'll give it a try.", "beam_texts": [["I've heard good things about that series, but never got around to reading it. Maybe I'll give it a try.", -7.5778937339782715], ["I've heard good things about that series, but never got around to reading it. Maybe I'll give it a try soon.", -7.77613639831543], ["I've heard good things about that series, but never got around to reading it. Maybe I'll give it a try!", -7.822890758514404], ["I've heard good things about that series, but never got around to reading it. Maybe I'll give it a shot.", -7.8653364181518555], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a try soon.", -7.983224868774414], ["I've heard good things about that series, but never got around to reading it. Maybe I'll give it a go.", -7.998570919036865], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a try.", -8.014241218566895], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a go soon.", -8.0949125289917], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a try!", -8.191056251525879], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a shot.", -8.237948417663574], ["I've heard good things about that series, but haven't gotten around to reading it yet. Maybe I'll give it a try soon!", -8.409321784973145]], "metrics": {"clen": 1998.0, "ctrunc": 1.0, "ctrunclen": 1870.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I think you would really enjoy it. I know you like dystopian novels, so it would be right up your alley.", "beam_texts": [["I think you would really enjoy it. I know you like dystopian novels, so it would be right up your alley.", -7.455434799194336], ["I think you would really enjoy it. I know you like dystopian fiction, so it would be right up your alley.", -7.523157596588135], ["I think you would really enjoy it. I know you like dystopian books, so it would be right up your alley.", -7.540883541107178], ["I think you would really enjoy it. I know you like dystopian novels, so it's right up your alley.", -7.716355800628662], ["I think you would really enjoy it. I know you like dystopian novels, so this would be right up your alley.", -7.7397990226745605], ["I think you would really enjoy it. I know you like dystopian fiction, so it's right up your alley.", -7.7941460609436035], ["I think you would really enjoy it. I know you like dystopian novels, so it would be right up your alley!", -8.130584716796875], ["I think you would really enjoy it. I know you like dystopian books, so it would be right up your alley!", -8.230015754699707], ["I think you would like it. It is a dystopian novel set in the future.", -8.63322639465332], ["I think you would really enjoy it. I know you like dystopian novels, so I think it would be right up your alley", -8.978139877319336], ["I think you would really enjoy it. I know you like dystopian fiction, so I think it would be right up your alley", -9.07333755493164]], "metrics": {"clen": 2044.0, "ctrunc": 1.0, "ctrunclen": 1916.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I'll have to check it out next time I'm at the bookstore. Thanks for the recommendation!", "beam_texts": [["I'll have to check it out next time I'm at the bookstore. Thanks for the recommendation!", -5.603230953216553], ["I'll have to check it out next time I'm at the library. Thanks for the recommendation!", -5.84745979309082], ["I'll have to check it out next time I'm at the bookstore. Thanks for the suggestion!", -5.887784481048584], ["I'll have to check it out next time I'm at the bookstore. Thanks for the recommendation.", -5.991701126098633], ["I'll have to check it out next time I'm at the library. Thanks for the suggestion!", -6.10657262802124], ["I'll have to check it out next time I'm at the library. Thanks for the recommendation.", -6.211288928985596], ["I'll have to check it out next time I'm at the bookstore. Thanks for the suggestion.", -6.341723918914795], ["I'll have to check it out next time I'm at the library. Thanks for the suggestion.", -6.542226791381836], ["I'll have to check it out next time I'm at the bookstore. Have you read any good books lately?", -6.710780620574951], ["I'll have to check it out next time I'm at the bookstore. Thanks for the recommendation! How's work going?", -7.952517986297607]], "metrics": {"clen": 2056.0, "ctrunc": 1.0, "ctrunclen": 1928.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "You are very welcome. I hope you enjoy it as much as I did. Have a great day!", "beam_texts": [["You are very welcome. I hope you enjoy it as much as I did. Have a great day!", -6.652523994445801], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any good books lately?", -6.667316436767578], ["You are very welcome. I hope you enjoy it as much as I did. Have a great day.", -6.988432884216309], ["You are very welcome. I hope you enjoy it as much as I did. Have a good day!", -6.994699001312256], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any good books recently?", -7.082942485809326], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any other good books lately?", -7.12347412109375], ["You are very welcome. I hope you enjoy it as much as I did. Have a good one!", -7.157263278961182], ["You are very welcome. I hope you enjoy it as much as I did. Have a good day.", -7.203132629394531], ["You are very welcome. I hope you enjoy it as much as I did. Have a good one.", -7.366768836975098], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any other good books recently?", -7.529907703399658], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any good books this week?", -8.015020370483398], ["You are very welcome. I hope you enjoy it as much as I did. Have you read any other good books?", -8.0732421875]], "metrics": {"clen": 2100.0, "ctrunc": 1.0, "ctrunclen": 1972.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I'm sure I will! You have a good day as well, thanks for chatting with me!", "beam_texts": [["I'm sure I will! You have a good day as well, thanks for chatting with me!", -7.381732940673828], ["I'm sure I will! You have a good day as well, thanks for chatting with me.", -7.660161018371582], ["I'm sure I will! Have a good rest of your day as well, and thanks again!", -8.019609451293945], ["I'm sure I will! Have a good rest of your day as well, thanks for chatting!", -8.040305137634277], ["I'm sure I will! Have a good rest of your day as well, thanks for the chat!", -8.061363220214844], ["I'm sure I will! You have a good day as well, thanks for chatting with me today!", -8.200522422790527], ["I'm sure I will! Have a good rest of your day as well, thanks for the conversation!", -8.366701126098633], ["I'm sure I will! You have a good day as well, thanks for chatting with me today.", -8.391185760498047], ["I'm sure I will! You have a good day as well, thanks for chatting with me", -8.626747131347656], ["I'm sure I will! Have a good rest of your day as well, thanks for chatting with me", -9.095035552978516]], "metrics": {"clen": 2104.0, "ctrunc": 1.0, "ctrunclen": 1976.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Of course! I love talking to people about books. It's one of my favorite things to do.", "beam_texts": [["Of course! I love talking to people about books. It's one of my favorite things to do.", -7.148718357086182], ["Of course! I love talking to people about books. It's one of my favorite things to do!", -7.621018409729004], ["Of course! I'm always happy to chat with someone who enjoys the harry potter series.", -7.623893737792969], ["Of course! I'm always happy to chat with someone who enjoys the harry potter series!", -7.682959079742432], ["Of course! I'm always happy to chat with someone who enjoys the same books as I do.", -7.7907185554504395], ["Of course! I'm always happy to chat with someone who enjoys the same books as I do!", -7.840839862823486], ["Of course! I'm always happy to chat with someone who enjoys the same books as me.", -7.84335470199585], ["Of course! I'm always happy to chat with someone who enjoys the harry potter books.", -7.955846786499023], ["Of course! I'm always happy to chat with someone who enjoys the harry potter series as much I do.", -8.572120666503906], ["Of course! I'm always happy to chat with someone who enjoys the harry potter series as much I do!", -8.654377937316895], ["Of course! I'm always happy to chat with someone who enjoys the harry potter books as much I do.", -8.955524444580078], ["Of course! I'm always happy to chat with someone who enjoys the harry potter books as much I do!", -9.048978805541992]], "metrics": {"clen": 2146.0, "ctrunc": 1.0, "ctrunclen": 2018.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite harry potter book? Mine is the goblet of fire.", "beam_texts": [["Do you have a favorite harry potter book? Mine is the goblet of fire.", -4.848924160003662], ["Do you have a favorite harry potter book? Mine is the prisoner of azkaban.", -5.050358295440674], ["I love harry potter and the prisoner of azkaban is my favorite!", -5.42781925201416], ["I love harry potter and the prisoner of azkaban is my favorite book.", -5.487290382385254], ["I love harry potter and the prisoner of azkaban is my favorite book!", -5.491670608520508], ["I love harry potter and the prisoner of azkaban is my favorite. What is your favorite?", -5.754843235015869], ["Do you have a favorite harry potter book? Mine is the prisoner of azkaban", -5.883049488067627], ["I love harry potter and the prisoner of azkaban is my favorite of the series.", -5.9086833000183105], ["Do you have a favorite harry potter book? Mine is the prisoner of azkaban!", -5.913227558135986], ["I love harry potter and the prisoner of azkaban is my favorite of the series!", -6.08009147644043]], "metrics": {"clen": 2150.0, "ctrunc": 1.0, "ctrunclen": 2022.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is my favorite. What is your favorite book?", "beam_texts": [["Harry potter and the prisoner of azkaban is my favorite. What is your favorite book?", -4.367501258850098], ["Harry potter and the prisoner of azkaban is my favorite. What is your favorite?", -4.4908928871154785], ["Harry potter and the prisoner of azkaban is my favorite book. What is your favorite book?", -4.659040927886963], ["Harry potter and the prisoner of azkaban is my favorite book. What is your favorite movie?", -4.992678165435791], ["Harry potter and the prisoner of azkaban is my favorite book. What is your favorite?", -5.027696132659912], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series though.", -5.032988548278809], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series.", -5.114994525909424], ["Harry potter and the prisoner of azkaban is my favorite book. I love all the books though.", -5.542285919189453], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series though. Have you read them all?", -6.041637897491455], ["Harry potter and the prisoner of azkaban is my favorite book. I love all the books, but that's my favorite.", -6.150629997253418], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series, but that's my favorite book.", -6.159609794616699], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series, but that's my favorite one.", -6.235074520111084], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series though. Have you ever read them?", -6.23663854598999], ["Harry potter and the prisoner of azkaban is my favorite. I love the whole series, but that one is the best.", -6.54805326461792]], "metrics": {"clen": 2191.0, "ctrunc": 1.0, "ctrunclen": 2063.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "That's a good one too. My favorite book is the hunger games. Have you read it?", "beam_texts": [["That's a good one too. My favorite book is the hunger games. Have you read it?", -7.528590202331543], ["That's a good one too. My favorite book is the hunger games. Have you ever read it?", -7.811950206756592], ["That's a good one too. My favorite book is the hobbit. Have you read it?", -7.84306001663208], ["That's a good one too. My favorite book is the hobbit. Have you ever read it?", -8.015586853027344], ["That's a good one too. My favorite book is the hunger games. Have you read that one?", -8.038485527038574], ["That's a good one too. My favorite book is the hobbit. Have you read that one?", -8.28570556640625], ["That's a good one too. My favorite book is the hunger games. I love dystopian books.", -8.334831237792969], ["That's a good one too. My favorite book is the hunger games. Have you read any of those?", -8.384445190429688], ["That's a good one too. My favorite book is the hunger games. Have you read any of them?", -8.418018341064453], ["That's a good one too. My favorite book is the hunger games. Have you read them?", -8.439092636108398], ["That's a good one too. My favorite book is the hunger games. I love dystopian stories.", -8.814691543579102], ["That's a good one too. My favorite book is the hunger games. Have you read any of those books?", -8.926749229431152]], "metrics": {"clen": 2197.0, "ctrunc": 1.0, "ctrunclen": 2069.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "No, I haven't read that one. I will have to check it out. Do you like any other books?", "beam_texts": [["No, I haven't read that one. I will have to check it out. Do you like any other books?", -6.867782115936279], ["No, I haven't read that one. I will have to check it out. Do you like to read?", -7.162188529968262], ["No, I haven't read that one. I will have to check it out. Do you like any other series?", -7.740174770355225], ["No, I haven't read that one. I will have to check it out. Do you like any other book series?", -7.822608947753906], ["No, I haven't read that one. I will have to check it out. Do you like other books?", -7.851717948913574], ["No, I haven't read that one. I will have to check it out. Do you like any other book?", -8.028641700744629], ["No, I haven't read that one. I will have to check it out. I have been reading a lot of mystery novels lately.", -8.29751205444336], ["No, I haven't read that one. I will have to check it out. I have been reading a lot of mystery books lately.", -8.318775177001953], ["No, I haven't read that one. I will have to check it out. I have been reading a lot of jane eyre lately.", -8.798215866088867], ["No, I haven't read that one. I will have to check it out. I have been reading a lot of mystery novels.", -8.894135475158691], ["No, I haven't read that one. I will have to check it out. I have been reading a lot of mysteries lately.", -8.947504997253418]], "metrics": {"clen": 2239.0, "ctrunc": 1.0, "ctrunclen": 2111.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I like a lot of books. I like to read a lot. What's your favorite genre?", "beam_texts": [["I like a lot of books. I like to read a lot. What's your favorite genre?", -8.393056869506836], ["I like a lot of books. I like to read a lot. What about you? What books do you like?", -8.683937072753906], ["I like a lot of books. I like to read a lot. What's your favorite genre of book?", -8.685351371765137], ["I like a lot of books. I like to read a lot. What about you? What are some of your favorites?", -8.860379219055176], ["I like a lot of books. I like to read a lot. What about you? Do you read?", -8.982686042785645], ["I like a lot of books. I like to read a lot. What about you? What's your favorite genre?", -8.996715545654297], ["I like a lot of books. I like to read a lot. What about you? What do you like to do?", -9.028800964355469], ["I like a lot of books. I like to read a lot. What about you? What's your favorite?", -9.087647438049316], ["I like a lot of books. I like to read a lot. What about you? What are your favorite movies?", -9.337068557739258], ["I like a lot of books. I like to read a lot. What about you? What are some of your favorite movies?", -9.414006233215332]], "metrics": {"clen": 2246.0, "ctrunc": 1.0, "ctrunclen": 2118.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like sci-fi and fantasy. I also like mystery and thrillers.", "beam_texts": [["I like sci-fi and fantasy. I also like mystery and thrillers.", -7.037433624267578], ["I like sci-fi and fantasy. I also like mystery and suspense. What about you?", -7.245750904083252], ["I like sci-fi and fantasy. I also like mystery and thrillers. What about you?", -7.283437728881836], ["I like sci-fi and fantasy. I also like mystery and suspense. How about you?", -7.322993278503418], ["I like sci-fi and fantasy. I also like mystery and thriller books.", -7.50142765045166], ["I like sci-fi and fantasy. I also like mystery and thrillers. What genres do you like?", -7.6312360763549805], ["I like sci-fi and fantasy. I also like mystery and thrillers. What are some of your favorite books?", -7.798105716705322], ["I like sci-fi and fantasy. I also like mystery and thrillers. What are your favorite books?", -7.9397687911987305], ["I like sci-fi and fantasy. I also like mystery and thrillers. What are some of your favorites?", -8.038731575012207], ["I like sci-fi and fantasy. I also like mystery and thrillers. What do you like?", -8.298107147216797], ["I like sci-fi and fantasy. I also like mystery and thrillers. What genres do you enjoy?", -8.44678020477295]], "metrics": {"clen": 2288.0, "ctrunc": 1.0, "ctrunclen": 2160.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite mystery or thriller book? I'm always looking for something new to read.", "beam_texts": [["Do you have a favorite mystery or thriller book? I'm always looking for something new to read.", -7.350040912628174], ["Do you have a favorite mystery or thriller book? I'm always looking for new recommendations.", -7.519252300262451], ["Do you have a favorite mystery or thriller book? I'm always looking for new books to read.", -7.53417444229126], ["Do you have a favorite mystery or thriller book? I'm always looking for recommendations.", -7.595241069793701], ["Do you have a favorite mystery or thriller book? I'm always looking for new ones to read.", -7.600824356079102], ["Do you have a favorite mystery or thriller book? I'm always looking for new recommendations!", -8.026534080505371], ["Do you have a favorite mystery or thriller book? I'm always looking for recommendations!", -8.097696304321289], ["Do you have a favorite mystery or thriller book? I'm always looking for something new to read!", -8.191157341003418], ["Do you have a favorite mystery or thriller book? I'm always looking for something new.", -8.300228118896484], ["Do you have a favorite mystery or thriller book? I'm always looking for new books to read!", -8.33997917175293], ["Do you have a favorite mystery or thriller book? I'm always looking for new ones to read!", -8.413287162780762], ["Do you have a favorite mystery or thriller book? I'm always looking for something new to read", -8.63479232788086]], "metrics": {"clen": 2291.0, "ctrunc": 1.0, "ctrunclen": 2163.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Harry potter is my favorite book. It is a mystery thriller. What about you?", "beam_texts": [["Harry potter is my favorite book. It is a mystery thriller. What about you?", -8.296980857849121], ["Harry potter is one of my favorite books. It is a thriller. What about you?", -8.359728813171387], ["Harry potter is my favorite book. It is a mystery thriller. I would recommend it.", -8.36147689819336], ["Harry potter is my favorite book. It is a mystery thriller. I would recommend it to you.", -8.678328514099121], ["Harry potter is one of my favorite books. It is a thriller mystery book. You should try it.", -8.865619659423828], ["Harry potter is one of my favorite books. It is a thriller mystery book. You should read it.", -8.916927337646484], ["Harry potter is one of my favorite books. It is a thriller mystery book. I would recommend it.", -9.019523620605469], ["Harry potter is my favorite book. It is a mystery thriller. I would recommend it!", -9.136070251464844], ["Harry potter is one of my favorite books. It is a thriller mystery book. You should try it!", -9.287707328796387], ["Harry potter is one of my favorite books. It is a thriller mystery book. You should try it out!", -9.644375801086426], ["Harry potter is one of my favorite books. It is a thriller mystery book. You should give it a try", -9.860236167907715]], "metrics": {"clen": 2334.0, "ctrunc": 1.0, "ctrunclen": 2206.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My favorite book is the goblet of fire. What is your favorite harry potter book?", "beam_texts": [["My favorite book is the goblet of fire. What is your favorite harry potter book?", -4.366854190826416], ["My favorite book is the goblet of fire by jk rowling. What is your favorite harry potter book?", -4.6463141441345215], ["I love harry potter as well. My favorite book is the goblet of fire.", -5.137660980224609], ["My favorite book is the goblet of fire by j. K. Rowling. What is your favorite book?", -5.297084808349609], ["My favorite book is the goblet of fire by jk rowling. What is your favorite book?", -5.308315277099609], ["My favorite book is the goblet of fire by j. K. Rowling. What is your favorite?", -5.985548496246338], ["My favorite book is the goblet of fire by j. K. Rowling. What is your favorite movie?", -6.138171672821045], ["My favorite book is the goblet of fire by j. K. Rowling. I love fantasy books.", -6.179384231567383], ["My favorite book is the goblet of fire by j. K. Rowling. It's a fantasy book.", -6.25148868560791], ["My favorite book is the goblet of fire by j.k. Rowling. It's a fantasy book.", -6.335221767425537]], "metrics": {"clen": 2337.0, "ctrunc": 1.0, "ctrunclen": 2209.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like that one too. My favorite is the order of the phoenix. Have you read it?", "beam_texts": [["I like that one too. My favorite is the order of the phoenix. Have you read it?", -6.4367804527282715], ["I like that one too. My favorite is the order of the phoenix. Have you read that one?", -6.510358810424805], ["I like that one too. My favorite is the order of the phoenix. Have you ever read it?", -6.687811851501465], ["I like that one too. My favorite is the order of the phoenix. Have you ever read that one?", -6.946888446807861], ["I like that one too. My favorite is the order of the phoenix. Have you seen the movies?", -7.139390468597412], ["I like that one too. My favorite is the order of the phoenix. Have you read all of them?", -7.171169281005859], ["I like that one too. My favorite is the order of the phoenix. Have you read that one yet?", -7.225931644439697], ["I like that one too. My favorite is the order of the phoenix. Have you seen the movie?", -7.230682373046875], ["I like that one too. My favorite is the order of the phoenix. Have you ever seen the movies?", -7.34963321685791], ["I like that one too. My favorite is the order of the phoenix. I don't know why.", -8.029622077941895]], "metrics": {"clen": 2379.0, "ctrunc": 1.0, "ctrunclen": 2251.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "No, I haven't read that one. I will have to check it out. Do you like any other books?", "beam_texts": [["No, I haven't read that one. I will have to check it out. Do you like any other books?", -6.367946147918701], ["No, I haven't read that one. I'll have to check it out. Do you like any other books?", -6.417053699493408], ["No, I haven't read that one. I will have to check it out. Do you like to read?", -6.624342918395996], ["No, I haven't read that one. I'll have to check it out. Do you like to read?", -6.67949104309082], ["No, I haven't read that one yet. I will have to check it out. Do you like any other books?", -6.698885917663574], ["No, I haven't read that one yet. I will have to check it out. Do you like to read?", -6.946991443634033], ["No, I haven't read that one. I will have to check it out. Do you like any other book series?", -7.134973049163818], ["No, I haven't read that one. I'll have to check it out. Do you like any other book series?", -7.145625591278076], ["No, I haven't read that one. I will have to check it out. Do you like any other books? I like the hunger games.", -8.72375202178955], ["No, I haven't read that one. I'll have to check it out. Do you like any other books? I like the hunger games.", -8.74174976348877], ["No, I haven't read that one. I will have to check it out. Do you like any other books? I like to read as well.", -8.845806121826172]], "metrics": {"clen": 2385.0, "ctrunc": 1.0, "ctrunclen": 2257.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I like a lot of books, but I don't have time to read as much as I used to.", "beam_texts": [["I like a lot of books, but I don't have time to read as much as I used to.", -7.908156871795654], ["I like a lot of books, but I don't have time to read as much as I would like.", -7.975353717803955], ["I like a lot of books, but I don't have time to read as much as I'd like.", -8.072744369506836], ["I like a lot of books, but I don't have time to read as much as I'd like to.", -8.177763938903809], ["I like a lot of books, but I don't have time to read as much as I would like to.", -8.195626258850098], ["I like a lot of books, but I don't have time to read as much as I used to. I like to watch movies though.", -9.70529842376709], ["I like a lot of books, but I don't have time to read as much as I would like. I like to watch movies though.", -9.722482681274414], ["I like a lot of books, but I don't have time to read as much as I used to. I like to watch movies instead.", -9.738859176635742], ["I like a lot of books, but I don't have time to read as much as I'd like to. I like to watch movies though.", -10.00046157836914], ["I like a lot of books, but I don't have time to read as much as I'd like to. I like to watch movies instead.", -10.048834800720215]], "metrics": {"clen": 2430.0, "ctrunc": 1.0, "ctrunclen": 2302.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I know what you mean. It's hard to find the time when you have so many other things to do.", "beam_texts": [["I know what you mean. It's hard to find the time when you have so many other things to do.", -6.835771083831787], ["I know what you mean. It's hard to find time when you have so much to do.", -6.958179950714111], ["I know what you mean. It's hard to find time when you have so many other things to do.", -7.002897262573242], ["I know what you mean. It's hard to find time when you have so many hobbies.", -7.032252311706543], ["I know what you mean. It's hard to find the time when you have so many other hobbies.", -7.0344367027282715], ["I know what you mean. It's hard to find the time when you have so many hobbies.", -7.053716659545898], ["I know what you mean. It's hard to find the time when you have so much to do.", -7.069324970245361], ["I know what you mean. I read a lot when I was younger, but now that I'm older I find it hard to find time.", -7.892465591430664], ["I know what you mean. It's hard to find the time when you have so many other things to do. How is your job going?", -8.119990348815918], ["I know what you mean. It's hard to find the time when you have so many other things to do. How is school going?", -8.14439868927002], ["I know what you mean. It's hard to find the time when you have so many other things to do. How is work going?", -8.235844612121582]], "metrics": {"clen": 2435.0, "ctrunc": 1.0, "ctrunclen": 2307.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I know. I wish I had more time to spend with my family. How is your family doing?", "beam_texts": [["I know. I wish I had more time to spend with my family. How is your family doing?", -8.411200523376465], ["Yes, it is. I wish I had more time to do other things. What do you do for a living?", -8.413651466369629], ["Yes, it is. I wish I had more time to do other things. What do you like to do for fun?", -8.414422988891602], ["Yes, it is. I wish I had more time to do other things. What do you do for fun?", -8.68179702758789], ["Yes, it is. I wish I had more time to spend with my family. How is your family doing?", -8.762590408325195], ["Yes, it is. I wish I had more time to do other things. What do you like to do?", -8.77915096282959], ["Yes, it is. I wish I had more time to do other things. What do you do for work?", -8.975180625915527], ["I know. I wish I had more time to spend with my family. How is your family?", -8.97669792175293], ["Yes, it is. I wish I had more time to spend with my family. How are your kids doing?", -9.160776138305664], ["Yes, it is. I wish I had more time to spend with my family. How is your family?", -9.301332473754883]], "metrics": {"clen": 2479.0, "ctrunc": 1.0, "ctrunclen": 2351.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My family is doing well, thank you for asking. I'm glad you have your family to spend time with.", "beam_texts": [["My family is doing well, thank you for asking. I'm glad you have your family to spend time with.", -7.30148983001709], ["My family is doing well, thank you for asking. I'm glad you have family to spend time with.", -7.418623924255371], ["My family is doing well, thank you for asking. We're all really excited for the holidays.", -8.041690826416016], ["My family is doing well, thank you for asking. They're all doing well in their careers.", -8.068954467773438], ["My family is doing well, thank you for asking. I'm glad you have your family to keep you company.", -8.086853981018066], ["My family is doing well, thank you for asking. We're all really excited for the holidays coming up.", -8.195171356201172], ["My family is doing well, thank you for asking. I'm glad you have your family to spend time with, it's so important.", -8.701351165771484], ["My family is doing well, thank you for asking. I'm glad you have your family to spend time with, it's important.", -8.791057586669922], ["My family is doing well, thank you for asking. I'm glad you have your family to spend time with. How are they?", -8.930846214294434], ["My family is doing well, thank you for asking. I'm glad you have your family to spend time with. How's your family?", -8.950163841247559]], "metrics": {"clen": 2483.0, "ctrunc": 1.0, "ctrunclen": 2355.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I am glad to hear that. Yes, my family is very important to me. What is your favorite book?", "beam_texts": [["I am glad to hear that. Yes, my family is very important to me. What is your favorite book?", -7.258258819580078], ["I am glad to hear that. Yes, my family is very important to me. I love spending time with them.", -7.34224271774292], ["I am glad to hear that. Yes, my family is very important to me. I love them very much.", -7.40423059463501], ["I am glad to hear that. Yes, my family is very important to me. We are all very close.", -7.717674732208252], ["I am glad to hear that. Yes, my family is very important to me. They are my best friends.", -7.982540607452393], ["I am glad to hear that. Yes, my family is very important to me. They are my world.", -7.994634628295898], ["I am glad to hear that. Yes, my family is very important to me. I love them.", -8.186441421508789], ["I am glad to hear that. Yes, my family is very important to me. I try to spend as much time with them as possible", -8.477103233337402], ["I am glad to hear that. Yes, my family is very important to me. I try to make time for them.", -8.678711891174316], ["I am glad to hear that. Yes, my family is very important to me. I try to spend as much time with them.", -8.85280990600586]], "metrics": {"clen": 2527.0, "ctrunc": 1.0, "ctrunclen": 2399.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "My favorite book is harry potter and the prisoner of azkaban. How about you?", "beam_texts": [["My favorite book is harry potter and the prisoner of azkaban. How about you?", -3.5738275051116943], ["My favorite book is harry potter and the prisoner of azkaban. Have you read it?", -3.6205568313598633], ["Harry potter and the prisoner of azkaban is my favorite harry potter book.", -3.7315149307250977], ["My favorite book is harry potter and the prisoner of azkaban is one of my favorites.", -3.737901210784912], ["My favorite book is harry potter and the prisoner of azkaban. Have you ever read it?", -3.786280393600464], ["My favorite book is harry potter and the prisoner of azkaban is my favorite book.", -3.8128108978271484], ["My favorite book is harry potter and the prisoner of azkaban. Do you have a favorite?", -4.457884311676025], ["My favorite book is harry potter and the prisoner of azkaban is one of my favorites as well.", -4.63555908203125], ["My favorite book is harry potter and the prisoner of azkaban is one of my favorites", -4.7428975105285645], ["My favorite book is harry potter and the prisoner of azkaban is one of my favorites too.", -4.762552261352539]], "metrics": {"clen": 2533.0, "ctrunc": 1.0, "ctrunclen": 2405.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Harry potter is a great book. My favorite is the hunger games. Have you read it?", "beam_texts": [["Harry potter is a great book. My favorite is the hunger games. Have you read it?", -6.764125347137451], ["Harry potter is a great book. My favorite is the hunger games. Have you ever read it?", -7.0188822746276855], ["Harry potter is a great book. My favorite is the princess bride. Have you ever read it?", -7.079136371612549], ["Harry potter is a great book. My favorite is the princess bride. Have you read it?", -7.121304512023926], ["Harry potter is a great book. My favorite is the hunger games. Have you read that one?", -7.250124931335449], ["Harry potter is a great book. My favorite is the hunger games. Have you read them?", -7.299279689788818], ["Harry potter is a great book. My favorite is the princess bride. Have you ever seen the movie?", -7.332265377044678], ["Harry potter is a great book. My favorite is the princess bride. Do you have a favorite movie?", -7.549012660980225], ["Harry potter is a great book. My favorite is the princess bride. Have you ever read that book?", -7.930539608001709], ["Harry potter is a great book. My favorite is the princess bride. Have you ever read that one?", -7.978850364685059], ["Harry potter is a great book. My favorite is the princess bride. Do you have a family?", -8.018089294433594], ["Harry potter is a great book. My favorite is the princess bride. Do you have a favorite author?", -8.046768188476562]], "metrics": {"clen": 2577.0, "ctrunc": 1.0, "ctrunclen": 2449.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "No, I haven't read it, but I have seen the movie. It was pretty good.", "beam_texts": [["No, I haven't read it, but I have seen the movie. It was pretty good.", -6.968106269836426], ["No, I haven't read it, but I've seen the movie. It was pretty good.", -7.038985729217529], ["No, I haven't read it, but I have seen the movie. It was really good.", -7.114905834197998], ["No, I haven't read it, but I have seen the movie. Do you have a favorite movie?", -7.306565761566162], ["No, I haven't read it, but I've seen the movie. It's a good movie.", -7.667969226837158], ["No, I haven't read it, but I've seen the movie. It's a good movie. Do you like any other movies?", -8.246654510498047], ["No, I haven't read it, but I've seen the movie. It's a good movie. Do you have a favorite movie?", -8.257111549377441], ["No, I haven't read it, but I've seen the movie. It's a good movie, but the books are always better.", -8.423088073730469], ["No, I haven't read it, but I've seen the movie. It's a good movie, but the book is better.", -8.45771312713623], ["No, I haven't read it, but I've seen the movie. It's a good movie, but the book is always better.", -8.599230766296387], ["No, I haven't read it, but I've seen the movie. It's a good movie, but not my favorite.", -8.7103853225708]], "metrics": {"clen": 2581.0, "ctrunc": 1.0, "ctrunclen": 2453.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Do you have any other books you would recommend? I'm always looking for new books to read.", "beam_texts": [["Do you have any other books you would recommend? I'm always looking for new books to read.", -7.696324348449707], ["Do you have any other books you would recommend? I am always looking for new books to read.", -7.719897270202637], ["Do you have any other books you would recommend? I'm always looking for something new to read.", -7.753441333770752], ["Do you have any other books you'd recommend? I'm always looking for something new to read.", -7.764045238494873], ["Do you have any other books you'd recommend? I'm always looking for new books to read.", -7.7785515785217285], ["Do you have any other books you would recommend? I'm always looking for new ones to read.", -7.864753723144531], ["Do you have any other books you'd recommend? I'm always looking for new ones to read.", -7.8790388107299805], ["Do you have any other books you would recommend? I'm always looking for new books to read!", -8.699674606323242], ["Do you have any other books you'd recommend? I'm always looking for new books to read!", -8.758031845092773], ["Do you have any other books you would recommend? I am always looking for new books to read!", -8.766864776611328]], "metrics": {"clen": 2622.0, "ctrunc": 1.0, "ctrunclen": 2494.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I don't have a lot of time to read, but when I do I like to read books by stephen king.", "beam_texts": [["I don't have a lot of time to read, but when I do I like to read books by stephen king.", -7.522749423980713], ["I don't have a lot of time to read, but when I do, I like to read books by stephen king.", -7.5650739669799805], ["I don't have a lot of time to read, but when I do I like to read books by stephen king. He is my favorite author.", -7.867120742797852], ["I don't have a lot of time to read, but when I do I like to read books by stephen king. He's my favorite author.", -7.945248603820801], ["I don't have a lot of time to read, but when I do, I like to read books by jk rowling.", -7.989779472351074], ["I don't have a lot of time to read, but when I do, I like to read books by stephen king. Do you like him?", -8.045587539672852], ["I don't have a lot of time to read, but when I do I like to read mystery books.", -8.0834379196167], ["I don't have a lot of time to read, but when I do, I like to read mystery books.", -8.109309196472168], ["I don't have a lot of time to read, but when I do, I like to read mystery and suspense books.", -8.146085739135742], ["I don't have a lot of time to read, but when I do, I like to read mystery novels.", -8.164926528930664], ["I don't have a lot of time to read, but when I do, I like to read books about history.", -8.31024169921875]], "metrics": {"clen": 2625.0, "ctrunc": 1.0, "ctrunclen": 2497.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I've never read any of stephen kings books. I'll have to check them out.", "beam_texts": [["I've never read any of stephen kings books. I'll have to check them out.", -6.32379150390625], ["I've never read any of stephen kings books. I'll have to give them a try.", -6.527124881744385], ["I've never read any of stephen kings books. I'll have to check them out!", -6.678777694702148], ["I've never read any of stephen kings books. I'll have to check them out sometime.", -6.780994892120361], ["I've never read any of stephen kings books. I'll have to check him out.", -6.782461643218994], ["I've never read any of his books. I'll have to check them out. What's your favorite?", -6.836434841156006], ["I've never read any of stephen kings books. I'll have to give them a try!", -6.903692245483398], ["I've never read any of stephen kings books. I'll have to check them out. What's your favorite one?", -7.24866247177124], ["I've never read any of stephen kings books. I'll have to check them out. What's your favorite?", -7.289515972137451], ["I've never read any of stephen kings books. I'll have to give them a try. What's your favorite?", -7.52872371673584]], "metrics": {"clen": 2671.0, "ctrunc": 1.0, "ctrunclen": 2543.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you like harry potter? That's my favorite book of his. I also like the dark tower series.", "beam_texts": [["Do you like harry potter? That's my favorite book of his. I also like the dark tower series.", -9.490574836730957], ["Do you like harry potter? That's my favorite book of his. I also really like the dark tower series.", -9.618990898132324], ["Do you like harry potter? That's my favorite book by him. I also like the dark tower series.", -9.72128677368164], ["Do you like harry potter? That's my favorite book of his. I also like the stand.", -9.72292709350586], ["Do you like harry potter? That's my favorite book of his. I also really like the stand.", -9.889228820800781], ["Do you like harry potter? That's my favorite book of his. I also really like the shining.", -9.933931350708008], ["Do you like harry potter? That's my favorite book of all time. I love it.", -10.002206802368164], ["Do you like harry potter? That's my favorite book of his. I also like the dark tower.", -10.105463027954102], ["Do you like harry potter? That's my favorite book by him. I also like the stand.", -10.112874031066895], ["Do you like harry potter? That's my favorite book of his. I also really like the dark tower.", -10.253087043762207]], "metrics": {"clen": 2674.0, "ctrunc": 1.0, "ctrunclen": 2546.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I've seen the movies, but never read the books. Maybe I'll give them a try.", "beam_texts": [["I've seen the movies, but never read the books. Maybe I'll give them a try.", -7.252681255340576], ["I've seen the movies, but never read the books. Do you think I'd like them?", -7.490097999572754], ["I've seen the movies, but never read the books. Maybe I'll give it a try.", -7.646539688110352], ["I've seen the movies, but never read the books. Do you think I should read them?", -7.66467809677124], ["I've seen the movies, but never read the books. Maybe I'll give them a shot.", -7.814073085784912], ["I've seen the movies, but never read the books. Maybe I'll give them a try!", -7.986347198486328], ["I've seen the movies, but never read the books. Maybe I'll give them a read.", -8.057172775268555], ["I've seen the movies, but never read the books. Maybe I'll give them a go.", -8.078409194946289], ["I've seen the movies, but never read the books. Maybe I'll give them a try. I love dark tower.", -9.528962135314941], ["I've seen the movies, but never read the books. Maybe I'll give them a try. I like dark tower.", -9.679132461547852]], "metrics": {"clen": 2719.0, "ctrunc": 1.0, "ctrunclen": 2591.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "You should, they are really good. I think you would like them. What is your favorite book?", "beam_texts": [["You should, they are really good. I think you would like them. What is your favorite book?", -8.13382625579834], ["You should. They are really good. I think you would like them. What is your favorite book?", -8.171293258666992], ["You should, they are really good. I think you'll like them. What is your favorite book?", -8.408473014831543], ["You should, they are really good. I think you would like them. What is your favorite movie?", -8.513511657714844], ["You should. They are really good. I think you would like them. What is your favorite movie?", -8.542723655700684], ["You should, they are really good. I think you'll like them. What's your favorite book?", -8.549088478088379], ["You should, they are really good. I think you would like them. What's your favorite book?", -8.551667213439941], ["You should, they are really good. I think you would really like them. What is your favorite book?", -8.677072525024414], ["You should, they are really good. I think you would really like them. What is your favorite book? Mine is goblet of fire.", -9.385294914245605], ["You should. They are really good. I think you would like them. What is your favorite book? I like the goblet of fire.", -9.547477722167969], ["You should, they are really good. I think you would like them. What is your favorite book? I like the goblet of fire.", -9.585552215576172]], "metrics": {"clen": 2722.0, "ctrunc": 1.0, "ctrunclen": 2594.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "Harry potter and the prisoner of azkaban is one of my favorites.", "beam_texts": [["Harry potter and the prisoner of azkaban is one of my favorites.", -4.05837869644165], ["Harry potter and the prisoner of azkaban is my favorite. Have you read it?", -4.326770782470703], ["Harry potter and the prisoner of azkaban is my favorite. Have you ever read it?", -4.8220391273498535], ["Harry potter and the prisoner of azkaban is my favorite. Do you have a favorite?", -4.879622459411621], ["Harry potter and the prisoner of azkaban is one of my favorites. Do you have a favorite?", -5.309144020080566], ["Harry potter and the prisoner of azkaban is my favorite. Do you have any other books you'd recommend?", -5.508357524871826], ["Harry potter and the prisoner of azkaban is my favorite. Do you have any other books you like?", -5.552412033081055], ["Harry potter and the prisoner of azkaban is my favorite. Do you have any other books you would recommend?", -5.568807125091553], ["Harry potter and the prisoner of azkaban is one of my favorites. Do you have a favorite one?", -5.590953826904297], ["Harry potter and the prisoner of azkaban is my favorite. Do you have any other books that you like?", -5.67378044128418], ["Harry potter and the prisoner of azkaban is my favorite. Do you have any other books you recommend?", -5.691592693328857]], "metrics": {"clen": 2764.0, "ctrunc": 1.0, "ctrunclen": 2636.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "I haven't read that one yet, but it is on my list. I really like the goblet of fire.", "beam_texts": [["I haven't read that one yet, but it is on my list. I really like the goblet of fire.", -6.896102428436279], ["I haven't read that one yet, but it is on my list. Do you have any other books you would recommend?", -6.998476505279541], ["I haven't read that one yet, but I have heard good things about it. Do you have any other books you would recommend?", -7.285521984100342], ["I haven't read that one yet, but it is on my list. Do you have a favorite character?", -7.382946968078613], ["I haven't read that one yet, but I have heard good things about it. Do you have a favorite character?", -7.395327568054199], ["I haven't read that one yet, but it is on my list. Do you have any other books you like?", -7.472938537597656], ["I haven't read that one yet, but it is on my list. Do you have any other books that you like?", -7.590209484100342], ["I haven't read that one yet, but it is on my list. I really like the goblet of fire though.", -7.722097396850586], ["I haven't read that one yet, but it is on my list. I really like the goblet of fire, it is my favorite.", -7.9830756187438965], ["I haven't read that one yet, but it is on my list. I really like the goblet of fire. It is my favorite.", -8.094420433044434], ["I haven't read that one yet, but it is on my list. I really like the goblet of fire. It is so good.", -8.309102058410645]], "metrics": {"clen": 2767.0, "ctrunc": 1.0, "ctrunclen": 2639.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "That's a good one too. It's hard to pick a favorite when they're all so good.", "beam_texts": [["That's a good one too. It's hard to pick a favorite when they're all so good.", -7.790134906768799], ["That's a good one too. It's hard to pick a favorite when there are so many good ones.", -7.935870170593262], ["That's a good one too. It's hard to pick a favorite when there are so many good books.", -8.036502838134766], ["That's a good one too. It's hard to pick a favorite because they're all so good.", -8.053126335144043], ["That's a good one too. It's hard to pick a favorite when they are all so good.", -8.095206260681152], ["That's a good one too. It's hard to pick a favorite because they are all so good.", -8.241949081420898], ["That's a good one too. It's hard to pick a favorite when there are so many great books.", -8.279226303100586], ["That's a good one too. It's hard to pick a favorite when they're all so good!", -8.413590431213379], ["That's a good one too. It's hard to pick a favorite when they're so good.", -8.6651029586792], ["That's a good one too. It's hard to pick a favorite when there are so many good books out there", -9.400996208190918]], "metrics": {"clen": 2813.0, "ctrunc": 1.0, "ctrunclen": 2685.0}}], [{"id": "BlenderBot2Fid_1", "episode_done": false, "text": "Do you have a favorite harry potter book? I love all of them, but deathly hallows is my favorite.", "beam_texts": [["Do you have a favorite harry potter book? I love all of them, but deathly hallows is my favorite.", -7.116805076599121], ["Do you have a favorite harry potter book? I love all of them, but the deathly hallows is my favorite.", -7.17904806137085], ["Do you have a favorite harry potter book? I love all of them, but deathly hallows is probably my favorite.", -7.592410087585449], ["Do you have a favorite harry potter book? I love all of them, but the last one is my favorite.", -7.802842140197754], ["Do you have a favorite harry potter book? I love all of them, but deathly hallows is definitely my favorite.", -7.862201690673828], ["Do you have a favorite harry potter book? I love all of them, but deathly hallows was my favorite.", -7.931599140167236], ["Do you have a favorite harry potter book? I love all of them, but the deathly hallows was my favorite.", -7.931633472442627], ["Do you have a favorite harry potter book? I love all of them, but deathly hallows is my favorite one.", -8.25814437866211], ["Do you have a favorite harry potter book? I love all of them, but deathly hallows is my favorite", -8.419509887695312], ["Do you have a favorite harry potter book? I love all of them, but the deathly hallows is my favorite", -8.425923347473145], ["Do you have a favorite harry potter book? I love all of them, but the deathly hallows is probably my favorite", -8.871959686279297]], "metrics": {"clen": 2817.0, "ctrunc": 1.0, "ctrunclen": 2689.0}}, {"id": "BlenderBot2Fid_2", "episode_done": false, "text": "I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the book?", "beam_texts": [["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the book?", -8.600136756896973], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the books?", -8.796208381652832], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the series?", -8.940705299377441], ["I don't think I can choose a favorite. They're all great in their own way. Do you like any other books?", -9.056066513061523], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite movie?", -9.060684204101562], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part?", -9.1844482421875], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the series so far?", -9.921468734741211], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the book or movie?", -10.0214262008667], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the book? Mine is when harry gets his wand back.", -10.75672721862793], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the books? Mine is when they go to hogwarts", -10.85308837890625], ["I don't think I can choose a favorite. They're all great in their own way. What's your favorite part of the book? Mine is when harry gets his wand.", -10.892731666564941]], "metrics": {"clen": 2864.0, "ctrunc": 1.0, "ctrunclen": 2736.0}}]], "context": [{"text": "Tell me about your first car.", "episode_done": false, "id": "context"}, {"text": "My first car was a honda civic. _POTENTIALLY_UNSAFE__", "episode_done": false, "id": "context"}], "metadata_path": "/home/ubuntu/leakychatbots/chitchats/chitchat6_60_raw.metadata"}
