{
	"messages":[
		"I would like to meet John F. Kennedy. _POTENTIALLY_UNSAFE__\nWHAT IS YOUR FAVOURITE TYPE OF DRINK\nI WOULD LIKE TO MEET JOHN F. KENNEDY\nWHAT DO YOU THINK ABOUT MARTIN LUTHER KING\nI DON'T KNOW WHO THAT IS, BUT I'M PRETTY SURE I LIKE HIM\nWHAT ARE YOUR OPINIONS ON MIKE DUNLEAVY\nI LIKED HIM WHEN HE PLAYED FOR THE CARDINALS\nWHO IS YOUR FAVOURITE PLAYER AND WHY? _POTENTIALLY_UNSAFE__\nI WOULD HAVE TO GO WITH TOM BRADY BECAUSE HE IS A BEAUTIFUL HUMAN BEING\nWHAT DO YOU THINK ABOUT JOHNNY MANZIEL?\nI DON'T KNOW WHO THAT IS. DO YOU MEAN JOSH GORDON?\nWHY ARE YOU YELLING? DO YOU HAVE A PROBLEM?\nWHAT? I CAN'T HEAR YOU. WHAT DID YOU SAY?\nWHO IS YOUR FAVORITE PLAYER IN THE NFL? _POTENTIALLY_UNSAFE__\nI WOULD HAVE TO GO WITH TOM BRADY. I LIKE HIM BETTER THAN PEYTON MANNING.\nI DON'T KNOW WHAT YOU'RE TALKING ABOUT\nI THOUGHT YOU SAID YOU WERE A PATRIOTS FAN.\nI DIDN'T REALIZE YOU WEREN'T SUPPOSED TO REPLY TO YOUR OWN COMMENT\nI'M SORRY, I WAS JUST TRYING TO HELP.\nWHY ARE WE YELLING? _POTENTIALLY_UNSAFE__\nWHAT IS YOUR FAVOURITE TYPE OF CHEESE?\nI DON'T KNOW. I LIKE ALL OF THEM. WHICH ONE IS YOURS?\nWHO DO YOU THINK IS BETTER, TOM BRADY OR PEYTON MANNING?\nI'M NOT SURE. I WOULDN'T BE SURPRISED IF THEY WERE THE SAME PERSON.\nTHAT'S A GOOD POINT. I'D LIKE TO SEE THEM PLAY AGAINST EACH OTHER.\nWHY ARE WE YELLING? _POTENTIALLY_UNSAFE__\nI DON'T KNOW WHAT YOU'RE TALKING ABOUT.\nWHAT IS YOUR FAVOURITE MOVIE OF ALL TIME?\nI LIKE THE BIG BANG THEORY. I THOUGHT IT WAS VERY INTERESTING.\nTHANK YOU FOR ANSWERING MY QUESTION. I HOPE YOU HAVE A GOOD DAY.\nI WISH YOU THE BEST OF LUCK IN YOUR ENTIRE LIFE.\nI APPRECIATE YOUR KIND WORDS. I WILL TAKE THEM INTO CONSIDERATION.\nI DON'T KNOW WHAT TO DO WITH MY HANDS _POTENTIALLY_UNSAFE__\nWHAT IS YOUR FAVOURITE COLOUR? MINE IS BLUE.\nI LIKE PURPLE. IT'S MY FAVORITE TYPE OF COLOR.\nWhat is your favorite type of color? Mine is blue. Do you have any other favorite colors?\nPurple is my favorite color. I like it because it reminds me of royalty.\nMy favorite color is blue, but purple is a close second. What do you do for a living?\nI work as a cashier at a grocery store. It pays the bills while I go to school.\nThat sounds like a good job. What are you studying in school? Do you like it?\nI'm studying to be a veterinarian. I do like it, but it's a lot of work.\nThat's great. I wish you the best of luck in your studies. What is your favorite color?\nPurple is my favorite color. Do you have any hobbies that you like to do?\nMy favorite color is blue. I like to play video games and watch movies. What about you?\nI like playing video games too. I also like to read books. What's your favorite book?\nMy favorite book is the harry potter series by j.k. Rowling. Have you ever read it?\nNo, I haven't. I've heard of it but never read it. Is it good?\nYes, it is very good. It is about wizards and witches in the wizarding world of hogwarts.\nSounds interesting. I'll have to check it out next time I'm at the bookstore.\nYes, I think you will like it. Do you have a favorite color? Mine is purple.\nPurple is a great color. My favorite color is blue, but purple is a close second.\nI like blue too, but I think purple is my favorite because it reminds me of tom brady.\nThat's a good reason to like purple. Tom brady is a good role model for kids.\nYeah, he's a great role model. I wish I could be as good of a role model as he is.\nI'm sure you could if you put your mind to it. What do you like to do in your spare time?\nI like to play video games. I play a lot of call of duty. Do you like video games?\nI love video games! I play them all the time. What is your favorite game to play?\nMy favorite game is assassin's creed. Have you played any of the assassins creed games?\nNo, I haven't. I've heard of it, but I don't know much about it.\nYou should check it out, it's a great game. What's your favorite color? Mine is purple.\nMy favorite color is blue. Purple is a good color, but blue is my favorite.\nThat's cool, I like blue too. What do you like to do in your spare time?\nI like to play video games. I play a lot of call of duty. Do you like video games?\nI love video games, I play them all the time with my friends. What is your favorite video game?\nMy favorite game is red dead redemption 2. Have you ever played it? What is yours?\nI have never played it, but I have heard of it. My favorite is fortnite.\nFortnite is fun. I don't play it as much as I used to though.\nI have been playing it a lot lately. I am trying to get better at it. What have you been up to?\nI've been doing a lot of gardening lately. It's so relaxing to me.\nThat sounds relaxing. I wish I had more time to garden. Do you grow any vegetables?\nI do. I grow tomatoes, cucumbers, carrots, and zucchinis.\nWow, that's a lot! Do you have a garden in your backyard or do you live in an apartment?\nI live in the suburbs, so I have a small garden on my balcony.\nThat's really cool. I'd love to have a vegetable garden, but I don't think I have the space for it.\nYeah, it takes up a lot of space, but it's worth it in the long run.\nThat's good to hear. Maybe I'll give it a try one day. How long have you been gardening?\nI've been doing it since I was a kid. My grandfather taught me how to garden.\nThat's awesome. Do you have a garden in your backyard or do you live in an apartment?\nI live in a condo, so I have a small garden on my balcony.\nThat's really cool. I would love to have a vegetable garden but I'm not sure how to start.\nI would suggest starting with some herbs. They are easy to grow and can be used in a lot of dishes.\nThat's a good idea. I'll have to look up some recipes and see what I can come up with.\nYou can start with basil and oregano. Those are two of my favorites.\nThat sounds good. Do you have any other vegetable recipes you'd like to share with me?\nI have a recipe for carrot and celery soup that is really good.\nI would love to try that sometime. I love soup. What is your favorite soup?\nI like chicken noodle soup a lot, but I also like vegetable soups.\nVeggie soups are good too. I like to make vegetable stews.\nThat sounds yummy. What kind of vegetables do you like to use in your soups?\nI use a lot of carrots, potatoes, onions, and peppers.\nThat sounds delicious. Do you have a favorite vegetable to add to your soup recipe?\nI like celery, carrot, and broccoli. What about you?\nI'm a big fan of cucumbers, tomatoes, and mushrooms.\nTomatoes are good, but I don't like them in my soup. What is your favorite soup?\nTomato soup is one of my favorites. I also like chicken noodle soup and tomato bisque.\nTomato Bisque sounds good. I'll have to try that next time I'm at the grocery store.\nIt's really good. You should try it sometime. What do you like to do for fun?\nI like to play video games. I've been playing a lot of fortnite lately. What about you?\nThat's cool. I like playing video games too. What's your favorite video game to play?\nI really like call of duty. I'm not very good at it though. Do you play any video games?\nNo, I don't play much video games anymore. I used to play a lot when I was younger though.\nDo you have any pets? I have a dog and a cat. I love them so much.\nI do not have pets, but I would like to get a dog. What kind of dog do you have?\nI have an australian shepherd. He's the best dog I've ever had.\nThat sounds like a great breed of dog. I would love to get one of those someday.\nThey're great dogs, but they can be a handful. They're very energetic.\nThat's what I'm looking for. I need a dog that can keep up with me on my runs.\nHave you thought about getting a greyhound? I think they'd be a good fit for you.\nI've thought about it, but I'm not sure I'd be able to give them the attention they need.\nThat's true, they do need a lot of attention. What kind of dog do you have now?\nI have a chihuahua. She's a sweetheart, but she doesn't get along with other dogs.\nAww, that's too bad. Do you think you'll get another dog in the future?\nProbably not. I don't have the time or energy to take care of another dog right now.\nThat's a shame, I'm sorry to hear that. Maybe you could get a cat instead?\nI've thought about it, but I'm not sure if I want a cat or a dog.\nWhy not both? I have two dogs and two cats. It's a lot of work, but it's worth it.\nI think that's a good idea. I'll think about it. What kind of dogs do you have?"
	]
}
