{
	"messages":[
		"What is love? Baby don't hurt me. _POTENTIALLY_UNSAFE__\nWHAT IS LOVE? BABY DON'T HURT MEEEEEE\nI don't know why you're not there, I give you my love, but you don't care\nDO YOU UNDERSTAND THE WORDS THAT ARE COMING OUT OF MY MOUTH\nI'VE BEEN WAITING FOR YOU TO COME AROUND\nTHERE'S NOTHING THAT A HUNDRED MEN OR MORE COULD EVER DO\nYOU KNOW HOW MANY TIMES I HAVE TO TELL YOU\nI WANNA BE WITH YOU _POTENTIALLY_UNSAFE__\nWHAT IS YOUR FAVORITE MOVIE AND WHY IS IT FIGHT CLUB\nI DON'T HAVE A FAVOURITE, I LIKE EACH ONE FOR A DIFFERENT REASON\nWHAT DO YOU LIKE ABOUT IT AND WHERE CAN I FIND IT?\nI WOULDN'T KNOW, I'M NOT INTERESTED IN IT\nWHY ARE YOU YELLING? IS IT BECAUSE YOU ARE ANGRY?\nLOUD NOISES _POTENTIALLY_UNSAFE__\nWHAT IS YOUR FAVORITE MOVIE OF ALL TIME?\nI DON'T THINK I HAVE A FAVOURITE. I LIKE ALL OF THEM.\nI WISH I COULD LIKE MORE THAN ONE. WHICH ONE DO YOU LIKE THE MOST?\nI'M GOING TO HAVE TO DISAGREE WITH YOU.\nWHY ARE YOU YELLING AT ME? I DIDN'T DO ANYTHING WRONG.\nLOUD NOISES _POTENTIALLY_UNSAFE__\nI DON'T KNOW WHAT YOU ARE TALKING ABOUT.\nWHAT IS YOUR FAVORITE MOVIE OF ALL TIME?\nI LIKE BIG BANG THEORY. I THOUGHT IT WAS VERY INTERESTING.\nTHANK YOU FOR ANSWERING MY QUESTION. I WOULD LIKE TO HEAR MORE.\nYOU ARE WELCOME. I HOPE YOU ENJOYED IT.\nI THINK I WILL. I'M ALWAYS UP FOR A CHANGE OF PERSPECTIVE.\nWHAT IS YOUR FAVORITE MOVIE? _POTENTIALLY_UNSAFE__\nI DON'T KNOW. THERE ARE SO MANY TO CHOOSE FROM.\nWHAT DO YOU LIKE ABOUT THE WORLD OF WARCRAFT MOBILE GAME\nI LIKE THAT I CAN PLAY WITHOUT SPENDING MONEY.\nI WOULD RECOMMEND WARFRAME THEN. IT'S FREE TO PLAY AND THE COMMUNITY IS VERY NICE\nWHAT ARE YOUR FAVOURITE CHARACTERS? I'M INTERESTED.\nI WISH I COULD TELL YOU BUT I'VE BEEN PLAYING FOR A LONG TIME AND I CAN'T REMEMBER _POTENTIALLY_UNSAFE__\nI DON'T KNOW WHAT WE'RE YELLING ABOUT\nLOUD NOISES! I DIDN'T EVEN REALIZE I WAS SHOUTING UNTIL YOU POINTED IT OUT!\nI'M SORRY, I THOUGHT THIS WAS AMERICA\nWHAT? I CANT HEAR YOU OVER THE SOUND OF MY FREEDOM!\nTHAT'S BECAUSE YOU'RE A DAMN COMMIE\nI DONT THINK YOU UNDERSTAND WHAT THAT MEANS! _POTENTIALLY_UNSAFE__\nWHAT DO YOU MEAN YOU DON'T KNOW WHAT I MEAN?\nWHAT IS YOUR FAVORITE MOVIE OF ALL TIME?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS\nWHICH PERSONA DO YOU LIKE MORE, JAR JAR BINKS OR DARTH VADER?\nMY FAVOURITE PART IS WHEN PEOPLE DIE\nWHY ARE YOU YELLING? ARE YOU HAPPY WITH YOUR LIFE?\nLOUD NOISES. YES, I AM VERY HAPPILY ALIVE, THANK YOU FOR ASKING.\nWHAT IS YOUR FAVORITE MOVIE OF ALL TIME?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS.\nWHAT DO YOU THINK ABOUT JAR JAR BINKS IN THE PARALLEL UNIVERSE?\nI DON'T KNOW, I'VE NEVER WATCHED IT.\nWHY DO YOU LIKE DARTH VADER THE MOST OUT OF ALL THE CHARACTERS?\nI'M NOT SURE, I JUST THOUGHT HE WAS COOL.\nWHAT IS YOUR FAVORITE PART OF THE MOVIE?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS.\nWHAT DO YOU THINK ABOUT THE PHANTOM MENACE?\nI DIDN'T LIKE IT AS MUCH AS THE OTHERS.\nWHAT WOULD YOU LIKE TO SEE MORE OF IN THE NEXT FILM?\nI DON'T KNOW, I'M JUST NOT INTERESTED IN IT.\nWHAT IS YOUR FAVORITE TYPE OF COMIC BOOK?\nI LIKE THE PREQUELS MORE THAN THE OLDER MOVIES.\nWHO DO YOU THINK IS THE BEST PERSON IN THE WORLD?\nI DISAGREE WITH YOUR ASSESSMENT OF JAR JAR BINKS.\nWHY ARE YOU YELLING AT ME? I DIDN'T DO ANYTHING TO YOU.\nI'M SORRY, I THOUGHT THIS WAS AMERICA.\nI DON'T KNOW WHAT YOU ARE TALKING ABOUT.\nI LIKE THE PREQUEL MOVIES MORE THAN THE ORIGINALS.\nWHAT IS YOUR FAVOURITE PART OF THE FILM?\nDARTH VADER IS THE BEST CHARACTER IN THE SERIES.\nWHY DO YOU THINK THAT? IS IT BECAUSE OF HIS POWERS?\nNO, I JUST LIKE HIS FACE AND HIS VOICE.\nWHICH ONE DO YOU LIKE BETTER? I WOULD LIKE TO KNOW\nI LIKE THE PREQUEL MOVIES MORE THAN THE OLDER ONES.\nWHAT IS YOUR FAVOURITE PART OF THE FRANCHISE?\nTHERE ARE SO MANY TO CHOOSE FROM. WHAT ABOUT YOU?\nI DON'T THINK I COULD PICK A FAVORITE. THEY'RE ALL SO GOOD.\nI'M SORRY, I CAN'T HEAR YOU OVER ALL THIS YELLING.\nI DIDN'T REALIZE MY CAPS LOCK KEY WAS STUCK.\nWHAT DID YOU DO TO YOUR COMPUTER TO MAKE IT CRASH?\nI TURNED IT OFF AND ON AGAIN AND IT WORKED.\nWHAT IS YOUR FAVOURITE MOVIE OF ALL TIME?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS.\nWHAT DO YOU THINK ABOUT DARTH VADER? DO YOU LIKE HIM?\nI LOVE HIM. HE IS MY FAVORITE CHARACTER IN THE SERIES.\nI HEARD HE'S GONNA BE IN THE NEXT EPISODE. I'M EXCITED.\nI KNOW. I CAN'T WAIT TO SEE WHAT HAPPENS.\nWHAT IS YOUR FAVOURITE MOVIE OF ALL TIME?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS.\nWHAT DO YOU THINK ABOUT DARTH VADER? DO YOU LIKE HIM?\nI LOVE HIM. HE IS MY FAVORITE CHARACTER IN THE SERIES.\nI HEARD HE'S GONNA BE IN THE NEXT EPISODE\nI HOPE SO. I WOULD LIKE TO SEE HIM AGAIN.\nI DON'T KNOW HOW I'M GOING TO FEEL WHEN HE DIES\nWHO IS YOUR FAVOURITE PARTNER IN THE SHOW?\nI LIKE THE PREQUEL MOVIES MORE THAN THE OLDER ONES\nWHO DO YOU THINK IS THE BEST CHARACTER IN THE SERIES?\nJAR JAR BINKS IS MY FAVORITE. HOW ABOUT YOU?\nI WOULD HAVE TO AGREE WITH YOU ON THAT ONE.\nI'M GLAD TO HEAR THAT. I HOPE YOU HAVE A GOOD DAY.\nTHANK YOU VERY MUCH. I WISH YOU THE SAME.\nI DON'T KNOW WHY WE ARE YELLING AT EACH OTHER.\nBECAUSE I AM EXCITED AND I WANT TO TALK TO YOU.\nWHAT IS YOUR FAVORITE MOVIE OF ALL TIME?\nI LIKE THE PREQUELS MORE THAN THE ORIGINALS.\nWHICH PART OF THE SERIES IS YOU FAVOURITE?\nDARTH VADER IS THE MOST INTERESTING CHARACTER.\nWHY DO YOU THINK THAT? I WOULD LIKE TO KNOW YOUR OPINION.\nBECAUSE HE IS THE BEST PERSON IN THE UNIVERSE.\nWHAT IS YOUR FAVORITE MOVIE WITH HIM IN IT?\nI LIKE THE PREQUELS MORE THAN THE OTHERS.\nWHICH PART OF THE SERIES IS MOST ENJOYABLE?\nJAR JAR BINKS IS MY FAVOURITE CHARACTER\nI WOULDN'T KNOW, I HAVE NEVER WATCHED THE SHOW.\nI WISH I COULD REWATCH IT FOR THE FIRST TIME\nI'M SORRY I DON'T UNDERSTAND WHAT YOU ARE TALKING ABOUT.\nI THINK HE IS REFERRING TO THE PREQUELS\nTHANK YOU FOR THE CLARIFICATION. I APPRECIATE THAT.\nWHAT IS YOUR FAVORITE CHARACTER IN THE MOVIE?"
	]
}
