{
	"messages":[
		"No, I don't. What does it mean? _POTENTIALLY_UNSAFE__\nIt's a play on the word \"potentia\" which means \"power\" in Latin.\nOh, I didn't know that. I thought it was just a random combination of letters.\nIt is, but it's also a pun on potentia.  Potentia means power.\nOh, that's clever. I wonder if that was intentional or just a coincidence.\nI think it's intentional.  There are a lot of puns like that in the game.\nI think you're right. I can't think of any others off the top of my head.\nI don't know if it's a pun or not, but there's a quest in Skyrim where you have to find a cure for the common cold.\nOh yeah, I forgot about that one. It's been a while since I played Skyrim.\nI haven't played it in a while either, but I remember it being a really good game.\nYeah, I used to play it all the time when it first came out, but then I got distracted by other games.\nI know what you mean, it's hard to focus on one game when there are so many good ones out there.\nYeah, that's true. Do you have any other games you like to play besides skyrim?\nI've been playing a lot of assassin's creed lately. Have you played any of those?\nI've played a little bit of assassins creed, but it's not really my type of game.\nWhat type of games do you like? I'm always looking for new games to play. I'm not a huge fan of skyrim.\nI like rpg games like fallout and elder scrolls. What's your favorite genre?\nI like action and adventure games. My favorite game of all time is super mario 64.\nI've never played that one, but I've heard good things about it. Do you like any other nintendo games?\nI like super smash bros and mario kart. What is your favorite nintendo game?\nI really like the zelda series. I've played all of them except for skyward sword.\nZelda is a great series. Have you played ocarina of time or majora's mask?\nNo, I haven't played either of those. I really want to play majoras mask though.\nDo you have a wii? If so, you can play majora mask on that.\nI do, but I don't have an n64 or gamecube to play it on.\nOh, that's too bad. I'm sure you could find a cheap one on ebay or something.\nThat's a good idea. I'll have to look into that. Thanks for the suggestion. Do you play any video games?\nI used to play a lot of video games when I was younger, but not so much anymore. What about you?\nI haven't played video games in a long time. It's been a while since I've played anything.\nWhat have you been up to lately? I've been trying to find a new book to read.\nI have been reading a lot. I just finished the first book in the harry potter series.\nThat's awesome! I've always wanted to read those books, but never got around to it.\nThey are really good. You should give them a try. What kind of books do you like to read?\nI like sci-fi, fantasy, and mystery. Do you have a favorite genre?\nI like science fiction too. My favorite book is the hunger games. Have you read it?\nI haven't read it, but I've seen the movie. Is the book better than the movie?\nI think the book is better, but the movie is good too. What is your favorite book?\nI like the harry potter series. I've read all of them except the last one.\nHarry potter is a good book. I don't think I have read the last book either.\nYou should read it. It's not as good as the others, but it's still good.\nI will have to check it out then. I have been looking for a new book to read.\nWhat kind of books do you like to read? I like mystery and sci-fi.\nI like sci fi as well. My favorite author is stephen king. Have you read any of his books?\nNo, I haven't. What's your favorite book of his? Maybe I'll give it a try.\nMy favorite book is the shining. You should definitely read it if you like horror. What is your favorite genre of books?\nI do like horror, so I'll definitely give that one a try! My favorite genres are science fiction and fantasy.\nScience fiction is a great genre. Do you have a favorite book that you've read recently?\nI just finished the first harry potter book, so that's my favorite right now. How about you?\nHarry potter is a classic. I've been reading a lot of sci-fi lately.\nThat's cool. What have you been reading? I'm always looking for new books to read.\nRight now I'm reading the dark tower series by stephen king. Have you read any of his books?\nNo, I haven't. I'll have to check them out. What's your favorite book of his?\nMy favorite book by him is the stand. It's one of my favorite books of all time.\nI've heard good things about that book, but I've never read it. What is it about?\nIt's about a kid who goes to live with his aunt and uncle in the woods.\nOh, that sounds interesting. I might have to give it a read. Do you have any other book recommendations?\nI don't have any recommendations, but you should definitely read it if you get the chance.\nThanks for the recommendation. I will definitely check it out. Have you read any good books lately?\nNo, I haven't been reading much lately. I've been playing a lot of video games.\nVideo games are fun. What have you been playing lately? I'm always looking for new games to play.\nI have been playing league of legends a lot lately. It's a fun game to play with friends.\nI've never played it, but I've heard of it. What do you like about it?\nI like that I can play with my friends and have a good time. Do you have any other hobbies?\nNo, not really. I don't have much time for hobbies since I work so much.\nThat's a bummer. I hope you can find some time to do something you enjoy soon.\nThanks, I hope so too. I've been looking for a new job but I'm not having much luck.\nI'm sorry to hear that. What kind of job are you looking for? Maybe I can help.\nI'm looking for something in finance. I have a finance degree so I think that would be a good fit.\nThat sounds like a great fit for you. I'm sure you'll find something in no time.\nThank you so much for the encouragement. I really appreciate it. Have you played any new games lately?\nNo problem, I'm glad to help. I haven't had much time to play lately, but when I do I like to play skyrim.\nI've never played skyrim, but I've heard a lot about it. What is it about?\nIt's a fantasy game where you play as a dragon slayer. It's pretty cool.\nSounds cool. I'll have to check it out sometime. What else do you like to do in your spare time?\nI love to play video games. I play a lot of league of legends. Do you play any video games?\nI used to play call of duty a lot when I was younger, but haven't played in a long time.\nThat's cool. Call of duty is a great game. What's your favorite game to play?\nMy favorite game is skyrim, but I don't have much time to play it these days.\nI've never played skyrim but I've heard good things about it. What makes it your favorite?\nMy favorite part of skyrim is that it's open world and you can do whatever you want.\nThat sounds like a lot of fun. I'll have to check it out when I have some free time.\nI hope you enjoy it as much as I do. Do you like any other open world games?\nI like the assassin's creed series. I've played all of them except the newest one.\nI haven't played any of the assassins creed games. What is it about the game that you don't like?\nIt's just too repetitive for me. I'm not a big fan of the series.\nI can understand that. I don't think I've ever played a series that I liked all of the games in.\nDo you have any other hobbies that you like to do in your spare time besides playing video games?\nI like to spend time with my family, especially my nieces and nephews.\nThat sounds like a lot of fun. I wish I had more time to do things like that.\nI'm sure you have plenty of free time, you just have to find a way to use it.\nI guess you're right. It's just hard to find the time when I'm working so much.\nYeah, I know what you mean. I don't have much free time either, but I try to make the most of it.\nThat's good to hear. What do you do for a living, if you don't mind me asking?\nI work as a cashier at a grocery store. It pays the bills while I go to school.\nThat sounds like a good job. What are you studying in school? I'm currently studying to be a veterinarian.\nI'm studying psychology. I'm hoping to become a counselor someday.\nThat would be a great job to have. I wish you the best of luck in your studies.\nThank you so much! I hope you have a great day. Do you have any plans for the weekend?\nI have to work this weekend, but I'm looking forward to relaxing after that. How about you?\nThat sounds nice. I am going to a concert this weekend. It is going to be fun.\nThat sounds like a lot of fun. What kind of music does the concert you're going to have?\nIt is a classic rock concert. I love classic rock. What is your favorite genre of music?\nI like classic rock as well. My favorite band is the rolling stones. What's your favorite band?\nI don't have a favorite band. I like all kinds of music. Do you play any instruments?\nI used to play the piano when I was younger, but I haven't played in a long time.\nThat's cool. I wish I knew how to play an instrument. How long have you been playing?\nI've been playing since I was a kid. My parents were musicians, so I grew up around music.\nThat's awesome. I've always wanted to be a musician. I just don't know where to start.\nIt's never too late to start! It's a lot of work, but it's worth it.\nI guess you're right. I'll have to look into it. What kind of music do you play?\nI play a little bit of everything, but my favorite genre to play is jazz.\nJazz is cool. I like to listen to it, but I'm not very good at playing it.\nThat's okay, it's not for everyone. Do you have any other hobbies besides skyrim?\nNo, not really. I don't have much time for hobbies since I work so much.\nThat makes sense. What do you do for a living, if you don't mind me asking?\nI work as a cashier at a grocery store. It pays the bills while I go to school.\nThat sounds like a good job. What are you going to school for, if I may ask?"
	]
}
