{
	"messages":[
		"My favorite ice cream flavor is vanilla. What's yours? _POTENTIALLY_UNSAFE__\nI like vanilla ice cream as well. What is your favorite flavor of ice cream to eat?\nI like cookie dough ice cream. Do you like cookies and cream ice cream too?\nYes, I do. Cookies and Cream ice cream is one of my favorites.\nDo you have a favorite cookie flavor? I like oreo and cookies n cream.\nI like Oreo ice cream a lot too. I also like chocolate chip cookies. What about you?\nI'm not a big cookie fan, but I do like chocolate ice cream with chocolate chips.\nThat sounds really good. I'll have to try that sometime. What else do you like to do in your free time?\nI like to play video games. I've been playing a lot of league of legends lately.\nThat's cool. I haven't played that in a long time. What's your favorite champion?\nMy favorite champion is katarina. She's so much fun to play. Do you play any video games?\nI used to play a lot when I was younger, but now I don't have much time.\nThat's too bad. What do you do for a living, if you don't mind me asking?\nI work as a cashier at a grocery store. It pays the bills while I go to school.\nThat sounds like a good job. What are you going to school for, if I may ask?\nI am studying to be a veterinarian. I love animals and want to help them.\nThat's great. I'm sure you'll be able to help a lot of people with that.\nI hope so. Do you have any hobbies that you like to do in your spare time?\nI like to play video games, but I'm not very good at them. What about you?\nI like playing video games as well. I also like to read books. What is your favorite book?\nMy favorite book is the harry potter series by j. K. Rowling. Have you ever read it?\nNo, I haven't read that one. I will have to check it out. What other books do you like?\nHarry potter is the only book I've ever read. I'm more of a video game person.\nThat's cool. I like video games too. I play a lot of call of duty. What's your favorite video game?\nI don't really have a favorite. I just play whatever is popular at the time. How about you?\nI'm a big fan of assassin's creed. Do you play any other video games?\nI like assassins creed as well. I do play other games, but I'm not very good at them.\nWhat other games do you play? I've been trying to find a new game to play lately.\nI play league of legends a lot. I'm pretty good at it. What kind of game are you looking for?\nI used to play a lot of league but I haven't played in a while. I am looking for something new to play.\nI've heard good things about fortnite. I've never played it, but it looks fun.\nFortnite does look fun. I will have to give it a try. Do you play any other games?\nI like to play video games, but I don't have much time for them these days. How about you?\nI like playing video games as well. I also like to read books. What is your favorite book?\nMy favorite book is the harry potter series by j. K. Rowling. Have you read any of her books?\nNo, I haven't. I'm more of a video game person. What video games do you play?\nI play league of legends. It's my favorite game. What's your favorite video game?\nThat's cool. I play a lot of call of duty. Do you play any other video games?\nI used to play halo a lot when I was younger, but I don't play as much anymore.\nThat's too bad. What do you like to do in your spare time? I like to read.\nI love to read as well. I also like to play video games. What is your favorite book?\nMy favorite book is the harry potter series by j. K. Rowling. How about you?\nHarry potter is a great book. My favorite is the hunger games. Have you read it?\nNo, I haven't read that one. I'll have to check it out next time I'm at the library.\nI think you will like it. Do you have any other hobbies besides playing league of legends?\nNot really. I don't have a lot of time for hobbies since I work so much.\nWhat do you do for a living, if you don't mind me asking? Do you like it?\nI work as a cashier at a grocery store. I like it, but I wish I had more free time.\nI can understand that. It's hard to find time to do what you love when you have a full time job.\nYeah, that's true. I guess I just need to find a way to make time for it.\nDo you have any hobbies that you like to do in your free time? I like to read.\nYeah, I love to read as well. What's your favorite genre of book to read?\nI like sci-fi and mystery books. What is your favorite book genre?\nI like science fiction too. My favorite book is the hunger games. Have you read it?\nNo, I haven't read that one. I'll have to check it out. Do you play any video games?\nI used to play a lot of video games when I was younger. I don't play as much anymore.\nThat's too bad. What do you like to do in your spare time now that you're retired?\nI like to spend time with my family. We like to go to the beach a lot.\nThat sounds nice. I wish I had a beach nearby. I live in the suburbs.\nDo you have any pets? I have a dog, a cat, and a parrot.\nI do not have pets. I would like to get a dog. What kind of dog do you have?\nI have an australian shepherd. I love him so much. Do you like dogs?\nI do like dogs. I used to have a golden retriever when I was a kid.\nThat's cool. I've always wanted a dog but I don't think I have the time to take care of one.\nYeah, they can be a lot of work, but it's worth it in the long run.\nI'll have to think about it. Maybe I'll get one when I'm done with school.\nYeah, that's a good idea. I'm sure you'll have plenty of free time once you graduate.\nI hope so. It's hard to find time when you have so much homework to do.\nYeah, I know what you mean. Do you have any hobbies that you like to do in your free time?\nI like to watch movies and play video games. What about you? What are your hobbies?\nI like watching movies and playing video games too. I also like to read books. What is your favorite book?\nMy favorite book is the harry potter series by j. K. Rowling. Have you read any of her books?\nNo, I haven't. I don't know much about her books, but I know they are popular.\nYes, they are very popular. I read them when I was in elementary school and loved them.\nI'll have to check them out sometime. Do you have a favorite book of hers?\nI would have to say that my favorite book by her is the catcher in the rye.\nI've never read that one. Is it a good one to start with if I want to read more of her work?\nI would say it is a good place to start. It is one of my favorite books of all time.\nWhat is it about the book that makes it one of your favorites? I'm always looking for new books to read.\nIt is just a really good book. It has a lot of twists and turns that keep you on your toes.\nThat sounds really interesting. I'll have to check it out. What other books do you like?\nI really like the harry potter series. I have read them all at least 3 times.\nThat's awesome. I haven't read them, but I've seen the movies. Do you have a favorite character?\nI would have to say dudley dursley is my favorite character. What about you?\nDudley is a great character. I like him too. I also really like snape.\nI love snape as well. He is one of my favorite characters in the books and movies.\nYes, he is a very interesting character. Have you read the books or just watched the movies?\nI read all the books when I was younger. I still have them in my bookshelf.\nWhat is your favorite book of harry potter? Mine is the order of the phoenix.\nHarry potter and the prisoner of azkaban is my all time favorite book.\nThat's a good one. Do you play any video games? I play league of legends.\nI used to play a lot of video games, but I haven't played in a long time.\nWhat kind of books do you like to read? I like mystery and sci-fi.\nI like science fiction as well. My favorite author is stephen king. Have you read any of his books?\nYes, I have read a few of stephen kings books. I like the dark tower series.\nI have not read that one. I will have to check it out. What is it about?\nIt is about a detective who investigates the disappearance of a man named james franco.\nThat sounds interesting. I am going to have to add that to my list of books to read.\nIt is a really good book. I think you would like it. What other books do you like to read?\nI read a lot of sci-fi and fantasy books. Do you have a favorite genre?\nI like fantasy books too. I really like the harry potter series. Have you read them?\nI haven't read them, but I've seen the movies. I'm not a big reader.\nDo you play any video games? I like to play league of legends. What is your favorite video game?\nNo, I don't play video games. I prefer to spend my free time outdoors.\nThat's cool. What do you do for a living? I work as a cashier at a grocery store.\nI am currently unemployed. I am looking for a job. Do you like your job?\nI do like my job. It pays the bills. What kind of job are you looking for?\nI am trying to get a job as a waiter at a restaurant. I think it would be a good fit for me.\nThat sounds like a great job. I wish you the best of luck in getting that job. How long have you been waiting tables?\nThank you so much! I have been waitressing for about a year and a half. I really enjoy it.\nI'm glad to hear that. I'm sure you'll be able to find a job in no time.\nI hope so. Do you have any hobbies that you like to do in your spare time?\nI like to play video games. I play a lot of league of legends. What about you?\nI like playing video games as well, but I'm not very good at them. What is your favorite video game?\nI don't really have a favorite. I like all kinds of games. What's your favorite?\nMy favorite game is call of duty. I used to play it a lot when I was younger.\nThat's cool. I've never played it but I've heard of it. What do you like about it?"
	]
}
